{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.13",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "SVM02"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0018287568,
                            0.0006280752,
                            0.001100352,
                            0.0009603696,
                            0.0019096257,
                            0.0010451699,
                            0.0007346091,
                            0.0008516993,
                            0.0013911662,
                            0.0009795359,
                            0.0006233051,
                            0.00090351177,
                            0.00078239007,
                            0.0044205924,
                            0.0,
                            0.0010001261,
                            0.0011509896,
                            0.00096789916,
                            0.0,
                            0.0011613986,
                            0.0014265539,
                            0.0,
                            0.0005288512,
                            0.0011318913,
                            0.00096377777,
                            0.0012358637,
                            0.00069105846,
                            0.0011944354,
                            0.0016262891,
                            0.0016891424,
                            0.005414406,
                            0.0,
                            0.0007400982,
                            0.0006849349,
                            0.0,
                            0.0011597618,
                            0.0022472525,
                            0.0011567487,
                            0.0,
                            0.0012658838,
                            0.0014865057,
                            0.0011323413,
                            0.0016592655,
                            0.010867961,
                            0.0013236916,
                            0.0014950447,
                            0.0012221555,
                            0.0012629622,
                            0.013887646,
                            0.0031414665,
                            0.0,
                            0.0013960061,
                            0.0013059597,
                            0.000713831,
                            0.0010374023,
                            0.0019398421,
                            0.0011400846,
                            0.0009261047,
                            0.0013840904,
                            0.0012453031,
                            0.00079676276,
                            0.04956879,
                            0.00066350546,
                            0.0011173681,
                            0.0008566066,
                            0.0010594621,
                            0.0016174829,
                            0.0010925279,
                            0.001058185,
                            0.0011364287,
                            0.0011600488,
                            0.026126903,
                            0.0021054388,
                            0.021374473,
                            0.0009221382,
                            0.0011178371,
                            0.0,
                            0.0010179845,
                            0.0013038644,
                            0.001036671,
                            0.0030477953,
                            0.0,
                            0.00084650324,
                            0.000891288,
                            0.0014989857,
                            0.0010423582,
                            0.00079590955,
                            0.0014464792,
                            0.0031886036,
                            0.0010994836,
                            0.355866,
                            0.0013512318,
                            0.0012072407,
                            0.0009706888,
                            0.0022060068,
                            0.000982071,
                            0.0007761833,
                            0.0036282828,
                            0.00058242376,
                            0.0010669552,
                            0.0012931493,
                            0.0011839819,
                            0.0,
                            0.0013062091,
                            0.001359525,
                            0.0012795032,
                            0.001111663,
                            0.0012942037,
                            0.001159647,
                            0.0013102869,
                            0.0,
                            0.03489542,
                            0.001139367,
                            0.00085060723,
                            0.0008931737,
                            0.001017507,
                            0.0013384979,
                            0.0019554736,
                            0.0012288893,
                            0.0011567272,
                            0.0020497926,
                            0.001105253,
                            0.0011347083,
                            0.0011559075,
                            0.00062459847,
                            0.001145426,
                            0.00075393263,
                            0.00082974887,
                            0.0008458368,
                            0.023354469,
                            0.0016732723,
                            0.0060141366,
                            0.0013255919,
                            0.0008688567,
                            0.0013400547,
                            0.0013511225,
                            0.0008144077,
                            0.0016053198,
                            0.00077574764,
                            0.0009851519,
                            0.00055742613,
                            0.00077626517,
                            0.004253357,
                            0.0017995152,
                            0.0010900708,
                            0.0013250744,
                            0.0010411803,
                            0.0,
                            0.0013219006,
                            0.0012910211,
                            0.0,
                            0.0010537491,
                            0.0010900272,
                            0.0011195644,
                            0.0013457073,
                            0.000666883,
                            0.0006727021,
                            0.001336823,
                            0.0015871784,
                            0.33936203,
                            0.0008871625,
                            0.00087046303,
                            0.00077920855,
                            0.0016847111,
                            0.0010429894,
                            0.0013071512,
                            0.00082479656,
                            0.0011540983,
                            0.0042285197,
                            0.0010582149,
                            0.0025799738,
                            0.0011385273,
                            0.0,
                            0.019528849,
                            0.0013251202,
                            0.0026998234,
                            0.1694392,
                            0.0011417002,
                            0.001061354,
                            0.0015674857,
                            0.000994232,
                            0.00091170904,
                            0.00065495365,
                            0.00079301535,
                            0.0015307236,
                            0.0010504795,
                            0.0012574742,
                            0.0016929774,
                            0.013080224,
                            0.0,
                            0.0017560741,
                            0.0015388405,
                            0.0063921167,
                            0.0011211481,
                            0.001040044,
                            0.001402606,
                            0.0010568522,
                            0.0011732847,
                            0.0008015132,
                            0.0013172937,
                            0.0015578757,
                            0.001163965,
                            0.0009901978,
                            0.0014131488,
                            0.0038033065,
                            0.0010200754,
                            0.001376857,
                            0.0013233669,
                            0.0027951663,
                            0.0016603546,
                            0.0010573645,
                            0.0013663991,
                            0.0,
                            0.0015860907,
                            0.00072869635,
                            0.0016705574,
                            0.00078702386,
                            0.10618339,
                            0.0011977392,
                            0.0013024232,
                            0.0226591,
                            0.0,
                            0.0,
                            0.001271536,
                            0.0010424849,
                            0.0,
                            0.0010413483,
                            0.00080516655,
                            0.0012652944,
                            0.0007590207,
                            0.0016120706,
                            0.0007840067,
                            0.0,
                            0.030901149,
                            0.0012376718,
                            0.0,
                            0.00083715585,
                            0.0010885888,
                            0.0013987147,
                            0.0010287376,
                            0.00089697307,
                            0.00087342155,
                            0.008800229,
                            0.001668722,
                            0.0013274673,
                            0.0,
                            0.00084862084,
                            0.0009527409,
                            0.0016621107,
                            0.001564989,
                            0.0010314266,
                            0.0,
                            0.0011024598,
                            0.0015104631,
                            0.0012740861,
                            0.0012171307,
                            0.0,
                            0.0,
                            0.0013763574,
                            0.001163848,
                            0.0010948924,
                            0.0,
                            0.0008368282,
                            0.0012324363,
                            0.0012542846,
                            0.0012746284,
                            0.0013475345,
                            0.00071027357,
                            0.010383644,
                            0.0007022415,
                            0.001129428,
                            0.0,
                            0.0011237748,
                            0.00084727874,
                            0.0010521696,
                            0.0009199456,
                            0.0019772325,
                            0.0,
                            0.23353526,
                            0.0009294416,
                            0.0012806252,
                            0.0010136819,
                            0.83963585,
                            0.012815027,
                            0.015374462,
                            0.39204177,
                            0.0014682771,
                            0.001477255,
                            0.0010232909,
                            0.0011655559,
                            0.0012266552,
                            0.00076216774,
                            0.0014721993,
                            0.001199382,
                            0.0014700502,
                            0.004585145,
                            0.00081541046,
                            0.0013581513,
                            0.0013614893,
                            0.0,
                            1.1293145,
                            0.02898286,
                            0.0014142048,
                            0.0010552194,
                            0.00093517697,
                            0.00097557687,
                            0.0013667269,
                            0.0016101899,
                            0.0,
                            0.001529436,
                            0.0014515781,
                            0.0010309397,
                            0.0011898921,
                            0.001212579,
                            0.0008644752,
                            1.1551921,
                            0.003612884,
                            0.00064594456,
                            0.0,
                            0.0010408915,
                            0.0006639528,
                            0.0052221213,
                            0.001320215,
                            0.001291941,
                            0.0017390033,
                            0.0013020723,
                            0.06684887,
                            0.0008170858,
                            0.003991137,
                            0.0013708234,
                            0.012601056,
                            0.00074467383,
                            0.0015428504,
                            0.0016981689,
                            0.0015258113,
                            0.0012422996,
                            0.001264355,
                            0.0,
                            0.0011843285,
                            0.0015548572,
                            0.0013612532,
                            0.0016455172,
                            0.0,
                            0.0,
                            0.0047681835,
                            0.0013387515,
                            0.0013618042,
                            0.0010569659,
                            0.00063929416,
                            0.0010558506,
                            0.001510711,
                            0.0011164037,
                            0.0044906526,
                            0.0010265581,
                            0.0,
                            0.0009448427,
                            0.003726403,
                            0.0,
                            0.010007429,
                            0.0012905768,
                            0.0010375171,
                            0.0,
                            0.0015335508,
                            0.0013840263,
                            0.0010386301,
                            0.002458789,
                            0.033077825,
                            0.0007796075,
                            0.0013657087,
                            0.0011686705,
                            0.0012344462,
                            0.00070168095,
                            0.0010942263,
                            0.0013084303,
                            0.00136335,
                            0.001306268,
                            0.0010720352,
                            0.0013200216,
                            0.0015374927,
                            0.0006181519,
                            0.0013354063,
                            0.0010587769,
                            0.0020025927,
                            0.0,
                            0.0008599817,
                            0.0013682916,
                            0.002918807,
                            0.0005656259,
                            0.039261974,
                            0.00091738073,
                            0.0011314236,
                            0.0013508116,
                            0.0017267698,
                            0.0012907727,
                            0.001354638,
                            0.0006410141,
                            0.00256838,
                            0.0,
                            0.0011175119,
                            0.0015047182,
                            0.001024212,
                            0.0012999577,
                            0.0012134744,
                            0.0,
                            0.0010934026,
                            0.0012502738,
                            0.00055120856,
                            0.0012520324,
                            0.0012709409,
                            0.0014759079,
                            0.0025168846,
                            0.0013104931,
                            0.0008408953,
                            0.0,
                            0.00130899,
                            0.0015094142,
                            0.0012691007,
                            0.013472825,
                            0.0009887052,
                            0.0013585192,
                            0.0014749117,
                            0.0013600079,
                            0.0010671947,
                            0.0008218187,
                            0.001158385,
                            0.0006375312,
                            0.0010390204,
                            0.0011684356,
                            0.0015599141,
                            0.0009938723,
                            -0.6643437,
                            -0.0,
                            -1.2310946,
                            -0.64991707,
                            -0.0,
                            -0.0,
                            -0.44439292,
                            -0.0,
                            -0.0,
                            -1.3451306,
                            -1.3912554,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.38686186,
                            -0.0,
                            -0.395874,
                            -0.0,
                            -0.0,
                            -0.33187106,
                            -0.25474283,
                            -0.4899502,
                            -0.7143192,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9091612,
                            -0.28873217,
                            -0.3207742,
                            -0.63752407,
                            -0.14564465,
                            -0.0,
                            -0.94094545,
                            -0.0,
                            -0.53527284,
                            -0.0,
                            -0.23076998,
                            -0.0,
                            -0.08439439,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.48927233,
                            -0.0,
                            -0.3861301,
                            -0.97191215,
                            -0.0,
                            -0.0,
                            -1.6881096,
                            -0.0,
                            -0.0023459962,
                            -0.0,
                            -0.0,
                            -0.1782007,
                            -0.69236696,
                            -0.0,
                            -1.7496626,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.58966404,
                            -1.0183955,
                            -0.47925794,
                            -1.1517135,
                            -0.89276046,
                            -0.4178167,
                            -0.0,
                            -1.8947529,
                            -0.0,
                            -0.0,
                            -0.1235091,
                            -0.05452473,
                            -1.1962768,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.90545917,
                            -0.81121475,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.21612,
                            -0.0,
                            -0.0,
                            -1.5985581,
                            -0.44717762,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7681696,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7330108,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.6910741,
                            -0.0,
                            -0.4165849,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.21257745,
                            -0.2741162,
                            -0.22142917,
                            -1.3124958,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.8260373,
                            -1.3035116,
                            -0.0,
                            -0.5107258,
                            -0.0,
                            -0.0,
                            -0.8909299,
                            -1.165112,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.12655555,
                            -0.0,
                            -0.0,
                            -1.1711297,
                            -0.0,
                            -0.7572493,
                            -1.7025119,
                            -0.0,
                            -0.0,
                            -0.31999594,
                            -0.2799077,
                            -0.6466491,
                            -0.8135126,
                            -1.5110003,
                            -0.0,
                            -0.0024709569,
                            -0.7243462,
                            -0.0,
                            -1.725947,
                            -0.8484887,
                            -0.7039062,
                            -0.0,
                            -0.2679931,
                            -1.3855338,
                            -0.0,
                            -0.105631895,
                            -1.1794072,
                            -0.2093041,
                            -0.55695873,
                            -0.6832184,
                            -0.0021765702,
                            -0.0,
                            -0.17818323,
                            -0.89273334,
                            -0.86794174,
                            -0.0,
                            -0.32651573,
                            -0.0,
                            -0.0,
                            -0.95662415,
                            -0.0,
                            -0.8942336,
                            -0.42179698,
                            -0.5198113,
                            -0.8053381,
                            -0.7593523,
                            -1.7318114,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.11295581,
                            -0.33036003,
                            -0.49546534,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2950704,
                            -0.20516051,
                            -1.14322,
                            -1.714686,
                            -0.0,
                            -0.74430966,
                            -0.5007858,
                            -0.66921294,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7098638,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2113701,
                            -0.4142602,
                            -0.0,
                            -1.3590134,
                            -0.0,
                            -0.8840911,
                            -0.0,
                            -0.0,
                            -0.7087209,
                            -0.0,
                            -1.3401837,
                            -1.0045578,
                            -0.0,
                            -1.3834271,
                            -1.4676132,
                            -0.966463,
                            -0.0,
                            -0.5724874,
                            -0.0,
                            -1.2180036,
                            -0.25939795,
                            -0.0,
                            -0.0,
                            -0.078565754,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0319653,
                            -0.0,
                            -1.5605564,
                            -1.5147524,
                            -0.0,
                            -1.4691061,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.33857962,
                            -0.0,
                            -0.21936247,
                            -0.0,
                            -0.0,
                            -0.045550853,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.307335,
                            -0.16316967,
                            -0.7197922,
                            -0.0,
                            -1.5142567,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5966595,
                            -0.0,
                            -1.2497299,
                            -0.7456598,
                            -0.2803752,
                            -0.0,
                            -0.05603469,
                            -0.2650153,
                            -0.0,
                            -0.36588785,
                            -0.0,
                            -0.27536282,
                            -0.0,
                            -0.31394458,
                            -0.0,
                            -0.7936488,
                            -0.0,
                            -0.5995403,
                            -0.0,
                            -0.032649107,
                            -0.05095026,
                            -0.0,
                            -0.84157354,
                            -0.0,
                            -0.0,
                            -0.048026342,
                            -0.0,
                            -0.0,
                            -0.122662835,
                            -0.53723806,
                            -0.3265235,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6018313,
                            -0.0,
                            -0.07443005,
                            -0.8236005,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.8932522,
                            -0.2850402,
                            -0.070531175,
                            -0.45211035,
                            -0.0059240516,
                            -0.9442221,
                            -0.0,
                            -1.0440762,
                            -0.0,
                            -0.2823072,
                            -0.52499944,
                            -0.7714017,
                            -0.0,
                            -0.44193238,
                            -0.50731796,
                            -0.12750664,
                            -0.013432766,
                            -0.4366419,
                            -0.15204805,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7016033,
                            -0.0,
                            -0.0,
                            -0.20624004,
                            -0.0,
                            -0.0,
                            -0.25661075,
                            -0.0,
                            -0.0,
                            -0.61551154,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.50032145,
                            -0.45851374,
                            -0.7918065,
                            -0.0,
                            -0.0,
                            -0.0863929,
                            -0.0,
                            -0.0,
                            -0.36016363,
                            -0.22223201,
                            -0.0,
                            -0.0,
                            -0.24340338,
                            -0.9014451,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.8376493,
                            -0.17684387,
                            -0.58547044,
                            -0.32843933,
                            -0.98111886,
                            -0.029396845,
                            -0.0,
                            -0.0,
                            -0.46818566,
                            -0.0,
                            -0.38203368,
                            -0.0,
                            -0.37731233,
                            -0.8730544,
                            -0.20273472,
                            -0.0,
                            -0.89596784,
                            -0.42915738,
                            -0.0,
                            -0.30818602,
                            -0.0,
                            -0.92818826,
                            -0.0,
                            -0.46459416,
                            -0.28502247,
                            -0.0,
                            -0.83074677,
                            -0.18694904,
                            -0.7944515,
                            -0.19856443,
                            -0.0,
                            -0.65529686,
                            -0.0,
                            -0.68624943,
                            -0.0,
                            -1.0257735,
                            -0.0,
                            -1.0138288,
                            -0.0,
                            -0.0,
                            -0.00439534,
                            -0.68874,
                            -0.73580295,
                            -0.11583512,
                            -0.0,
                            -0.48820737,
                            -0.0,
                            -0.0,
                            -0.12731114,
                            -0.0,
                            -0.0,
                            -1.0615948,
                            -0.5060738,
                            -0.93135643,
                            -1.0993786,
                            -0.44450006,
                            -0.43211263,
                            -0.9253302,
                            -0.4455202,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6019527,
                            -0.10958107,
                            -0.0,
                            -0.9177022,
                            -0.14346738,
                            -0.8224932,
                            -0.0,
                            -0.0,
                            -0.5717783,
                            -0.5051973,
                            -0.3277108,
                            -0.12772673,
                            -0.09657811,
                            -0.076286845,
                            -0.3410393,
                            -0.28938526,
                            -0.22213633,
                            -0.52452326,
                            -0.0062273834,
                            -0.031241147,
                            -0.6729666,
                            -1.1984651,
                            -0.6522503,
                            -0.0,
                            -0.0,
                            -1.0724558,
                            -0.28932002,
                            -0.62884325,
                            -1.0295461,
                            -0.0,
                            -0.19397427,
                            -0.47265464,
                            -1.486206,
                            -0.0,
                            -0.76518595,
                            -0.65595776,
                            -0.0,
                            -0.0,
                            -0.31391296,
                            -0.6618277,
                            -0.13976277,
                            -0.42783818,
                            -0.0,
                            -0.38765422,
                            -0.38397926,
                            -0.6101978,
                            -0.23886466,
                            -0.0,
                            -0.5653405,
                            -0.5175967,
                            -0.4135368,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5872288,
                            -0.0,
                            -0.8674817,
                            -0.5056632,
                            -0.0,
                            -0.820169,
                            -0.75655353,
                            -0.0,
                            -1.1739594,
                            -0.43872416,
                            -1.016769,
                            -0.9878611,
                            -0.0,
                            -0.0,
                            -0.13553995,
                            -0.13241401,
                            -0.8286119,
                            -0.0,
                            -0.4787199,
                            -0.47677562,
                            -0.6616629,
                            -0.0,
                            -0.608978,
                            -1.3752302,
                            -0.19384605,
                            -0.73358005,
                            -1.1814531,
                            -0.30648166,
                            -0.503479,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.315275,
                            -0.022230167,
                            -0.7986759,
                            -0.31231058,
                            -0.0,
                            -0.0,
                            -0.03538254,
                            -0.0,
                            -0.07849773,
                            -0.8833547,
                            -0.0,
                            -0.9885577,
                            -0.3135355,
                            -0.9158655,
                            -0.0,
                            -0.8762602,
                            -0.47942892,
                            -0.92625654,
                            -0.0,
                            -0.3180701,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.44083568,
                            -0.0,
                            -0.0,
                            -0.90665627,
                            -0.9630719,
                            -0.5705075,
                            -0.0,
                            -0.44510204,
                            -0.26125163,
                            -0.17837784,
                            -0.78768414,
                            -1.1436577,
                            -0.0,
                            -0.68399125,
                            -0.620504,
                            -0.0010507705,
                            -0.74381703,
                            -0.9058196,
                            -0.14168495,
                            -0.61732256,
                            -0.0,
                            -0.89813864,
                            -0.0,
                            -0.0,
                            -0.6255463,
                            -0.8181313,
                            -0.27875012,
                            -0.0,
                            -1.0502636,
                            -0.0,
                            -0.0,
                            -0.07673606,
                            -0.35429093,
                            -0.0,
                            -0.0,
                            -0.67296827,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5801284,
                            -0.0,
                            -0.0,
                            -0.28509486,
                            -0.6266703,
                            -0.83334166,
                            -0.10627939,
                            -0.0,
                            -0.89638865,
                            -0.61080706,
                            -0.34697506,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.06466087,
                            -0.3283576,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9301537,
                            -0.0,
                            -0.0,
                            -0.416164,
                            -0.0,
                            -1.5130965,
                            -0.0,
                            -0.0,
                            -1.3835447,
                            -0.780864,
                            -0.0,
                            -0.816428,
                            -1.0170434,
                            -1.2168442,
                            -0.027895395,
                            -0.4100148,
                            -0.3948417,
                            -1.0226963,
                            -0.0,
                            -0.98775613,
                            -0.3393991,
                            -0.8896365,
                            -0.064745516,
                            -0.0,
                            -0.0,
                            -0.01889378,
                            -0.8496755,
                            -0.25905237,
                            -0.30288312,
                            -0.15580468,
                            -0.6096945,
                            -0.42058724,
                            -0.13008937,
                            -0.25614303,
                            -0.0,
                            -0.91490716,
                            -1.0875119,
                            -0.033729378,
                            -0.0,
                            -0.67819965,
                            -0.16116872,
                            -0.0,
                            -0.16321152,
                            -0.0,
                            -0.29750574,
                            -0.0,
                            -0.13172969,
                            -0.0,
                            -0.0,
                            -0.45896563,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0484883,
                            -0.0,
                            -0.22803378,
                            -0.24020147,
                            -0.0,
                            -0.0,
                            -0.20365557,
                            -0.18804412,
                            -0.8517126,
                            -1.0083965,
                            -0.0,
                            -0.9489395,
                            -0.024375247,
                            -0.0,
                            -0.102754004,
                            -0.0,
                            -0.0,
                            -0.9137861,
                            -1.5155354,
                            -1.3316193,
                            -0.6034731,
                            -0.67621475,
                            -0.0,
                            -0.1156662,
                            -0.0,
                            -0.94978124,
                            -0.8046739,
                            -0.0,
                            -0.9679225,
                            -0.18066896,
                            -0.379819,
                            -0.0,
                            -0.8133023,
                            -0.37757134,
                            -0.0,
                            -0.0,
                            -0.44223046,
                            -0.6552284,
                            0.15115188,
                            0.16016823,
                            0.17099893,
                            0.12862603,
                            0.1858061,
                            0.15842104,
                            0.12147052,
                            0.12473975,
                            0.17721137,
                            0.16245565,
                            0.13103452,
                            0.15213782,
                            0.17311068,
                            0.14219807,
                            0.14195794,
                            0.17282188,
                            0.17946403,
                            0.17317301,
                            0.14203973,
                            0.16762392,
                            0.17645018,
                            0.068104945,
                            0.09816494,
                            0.1801035,
                            0.17210917,
                            0.1737144,
                            0.17250918,
                            0.1721918,
                            0.17685689,
                            0.1760502,
                            0.23811042,
                            0.119231954,
                            0.16886175,
                            0.11250053,
                            0.11851532,
                            0.1807492,
                            0.16481853,
                            0.17818029,
                            0.061452996,
                            0.16820341,
                            0.16733284,
                            0.1688631,
                            0.1749027,
                            0.25181657,
                            0.17462431,
                            0.16332316,
                            0.17832293,
                            0.168247,
                            0.24260846,
                            0.1898197,
                            0.12294565,
                            0.17689869,
                            0.1741331,
                            0.16326363,
                            0.1785763,
                            0.16715434,
                            0.12645388,
                            0.15552218,
                            0.18158619,
                            0.15676993,
                            0.1553847,
                            0.39037004,
                            0.13275509,
                            0.17766386,
                            0.16177343,
                            0.16332486,
                            0.15197104,
                            0.17586112,
                            0.1624614,
                            0.16867515,
                            0.147804,
                            0.23410183,
                            0.13334723,
                            0.23819193,
                            0.14660078,
                            0.17738935,
                            0.16821218,
                            0.1759055,
                            0.16509151,
                            0.17727065,
                            0.17851904,
                            0.08833139,
                            0.1292961,
                            0.16110092,
                            0.17798844,
                            0.17910549,
                            0.115145385,
                            0.17612162,
                            0.17898367,
                            0.17679304,
                            1.5292423,
                            0.17881918,
                            0.16595547,
                            0.17681691,
                            0.10721096,
                            0.1645907,
                            0.122470275,
                            0.19167313,
                            0.14856748,
                            0.17829743,
                            0.17669252,
                            0.17050393,
                            0.11389604,
                            0.1804739,
                            0.14533015,
                            0.17114162,
                            0.18037088,
                            0.1727499,
                            0.17895064,
                            0.17733297,
                            0.1041525,
                            0.33393416,
                            0.18066944,
                            0.17280759,
                            0.16063169,
                            0.16973947,
                            0.17702593,
                            0.1702965,
                            0.16982192,
                            0.16037548,
                            0.32119983,
                            0.1675975,
                            0.17574343,
                            0.18053569,
                            0.13463588,
                            0.1969574,
                            0.14096722,
                            0.16091892,
                            0.14931206,
                            0.13462599,
                            0.17561577,
                            0.24167222,
                            0.15807103,
                            0.15056612,
