{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.8.0",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "probabilities"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            2.6037183,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            4.738639,
                            0.0,
                            0.0,
                            0.0,
                            2.5475533,
                            0.0,
                            0.0,
                            0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.103808045,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2487439,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2585809,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.06873126,
                            -0.0,
                            -0.0,
                            -0.3444967,
                            -2.8852525,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9056799,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.40980938,
                            -0.0,
                            -0.0,
                            -0.7873506,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.96546495,
                            -0.0,
                            -0.91199213,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -9.115513,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -55.424862,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.41411772,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.2218156,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -95.20125,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -30.536207,
                            -0.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -1.5234277,
                            -0.0,
                            -0.0,
                            -2.713619,
                            -0.0,
                            -29.922104,
                            -5.5804467,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -11.799162,
                            -0.0,
                            -0.0,
                            -37.395107,
                            -41.593853,
                            -0.0,
                            -0.0,
                            -28.215225,
                            -71.816505,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.6401432,
                            -33.39207,
                            -40.917152,
                            -0.0,
                            -0.0,
                            -0.0,
                            -14.310876,
                            -18.54926,
                            -0.0,
                            -25.722582,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            4.0703454,
                            0.0,
                            0.0,
                            64.105965,
                            1.1244903,
                            1.1482786,
                            1.3112228,
                            0.6212138,
                            0.5330876,
                            1.2119849,
                            1.384416,
                            0.51457113,
                            0.4751128,
                            0.0,
                            1.075217,
                            1.2823104,
                            1.5515939,
                            0.8706237,
                            1.1794819,
                            0.8576769,
                            1.3120275,
                            0.563013,
                            1.4540412,
                            0.5471426,
                            0.6069461,
                            0.82495254,
                            1.0637901,
                            0.81576383,
                            1.7356961,
                            1.166167,
                            0.6558713,
                            0.15001464,
                            1.1540301,
                            0.9028484,
                            1.0003796,
                            1.0643891,
                            1.2623191,
                            1.3430015,
                            0.28449938,
                            0.0,
                            0.40479955,
                            0.5703436,
                            1.9230889,
                            4.7839355,
                            1.0226363,
                            0.6827719,
                            1.2603618,
                            0.58026475,
                            0.0,
                            0.58174044,
                            0.87048256,
                            0.63590616,
                            2.2333972,
                            0.6151549,
                            0.22086883,
                            0.77975535,
                            1.0827909,
                            1.0770342,
                            1.1429646,
                            1.2249242,
                            0.0,
                            0.56769776,
                            0.47035637,
                            0.98610777,
                            1.0957764,
                            0.85834277,
                            0.3100608,
                            2.0841925,
                            0.3383037,
                            1.1546223,
                            0.0,
                            0.5079679,
                            0.23964113,
                            2.0582078,
                            1.1596762,
                            1.3039238,
                            0.79475206,
                            0.7963874,
                            0.88240796,
                            0.8837754,
                            3.5587816,
                            0.8851615,
                            1.929576,
                            0.46679947,
                            1.5207065,
                            1.2137341,
                            0.28356436,
                            1.025479,
                            1.0621637,
                            1.4595143,
                            0.59786683,
                            -0.6375235,
                            -0.63974255,
                            -0.6398577,
                            -0.6393345,
                            -0.63884896,
                            -0.6394603,
                            -0.63837636,
                            -0.63490963,
                            -0.6396442,
                            -0.63933307,
                            -0.6396444,
                            -4.001802,
                            -0.6393813,
                            -0.6393875,
                            -0.6348597,
                            -1.117433,
                            -0.5748568,
                            -0.639999,
                            -0.62400323,
                            -0.5109586,
                            -0.63971454,
                            -0.63954586,
                            -0.63982725,
                            -0.62141645,
                            -0.6274609,
                            -0.6384278,
                            -0.6272688,
                            -11.841623,
                            -0.5749494,
                            -0.6395503,
                            -0.6393129,
                            -0.6397226,
                            -0.63954645,
                            -0.5812666,
                            -1.2541443,
                            -0.63931775,
                            -0.6396162,
                            -0.639544,
                            -0.64891666,
                            -0.6389962,
                            -1.3476937,
                            -0.6393775,
                            -0.6396273,
                            -0.63921255,
                            -0.63945687,
                            -0.63958395,
                            -0.63963234,
                            -0.639524,
                            -1.4147764,
                            -0.6397166,
                            -3.2787786,
                            -0.639738,
                            -0.6395836,
                            -0.639658,
                            -0.63962096,
                            -0.63970363,
                            -0.63923335,
                            -5.0174108,
                            -0.6396478,
                            -0.30973893,
                            -0.6391589,
                            -0.6396552,
                            -0.6394834,
                            -0.63872313,
                            -0.63972783,
                            -0.6141068,
                            -1.8662136,
                            -0.63159734,
                            -5.561697,
                            -0.6392473,
                            -0.6240384,
                            -0.6318417,
                            -0.75307864,
                            -0.6391589,
                            -0.6230764,
                            -0.63935465,
                            -0.6400257,
                            -0.63959724,
                            -0.6140802,
                            -0.63882816,
                            -0.63972783,
                            -0.6395696,
                            -0.63971454,
                            -0.6271764,
                            -0.63968027,
                            -0.6377908,
                            -0.63935465,
                            -0.0,
                            -1.7522275,
                            -0.85966647,
                            -0.590957,
                            -0.0,
                            -0.38198674,
                            -1.6696353,
                            -0.0,
                            -3.5320294,
                            -0.0,
                            -2.2843523,
                            -0.0,
                            -1.270789,
                            -0.0,
                            -2.0567412,
                            -0.0,
                            -0.0,
                            -1.0699552,
                            -0.0,
                            -1.5679821,
                            -0.0,
                            -0.8671797,
                            -0.0,
                            -0.0,
                            -2.8927455,
                            -0.0,
                            -1.5257634,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.4104346,
                            -4.338579,
                            -1.9578373,
                            -0.0,
                            -2.6381543,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.4478263,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.54558456,
                            -1.5322059,
                            -2.2112606,
                            -0.096536115,
                            -1.600485,
                            -0.0,
                            -0.1273634,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7885544,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.58111984,
                            -0.0,
                            -2.1803062,
                            -0.57546586,
                            -1.347804,
                            -0.0,
                            100.0,
                            100.0,
                            31.548754,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            0.0,
                            100.0,
                            100.0,
                            16.769836,
                            36.00034,
                            7.510058,
                            100.0,
                            100.0,
                            0.03542889,
                            0.7176229,
                            0.025544588,
                            1.1950238,
                            0.0,
                            0.05687369,
                            0.032214075,
                            0.0,
                            0.0,
                            1.1238717,
                            0.59370077,
                            0.042748094,
                            1.1579885,
                            0.5151179,
                            3.3097136,
                            0.0,
                            0.0,
                            0.0,
                            3.1370366,
                            0.99136657,
                            0.22371216,
                            0.0,
                            0.0,
                            0.7517581,
                            0.5636384,
                            0.0,
                            0.0,
                            0.0,
                            0.5266276,
                            0.44306868,
                            0.0,
                            0.79699326,
                            0.19879384,
                            0.06251493,
                            0.11296656,
                            1.0122331,
                            0.25510335,
                            0.0,
                            0.0,
                            8.609688,
                            0.7568274,
                            0.0,
                            0.0,
                            0.0,
                            0.59504867,
                            0.0,
                            0.0,
                            0.0,
                            4.4314766,
                            0.26690084,
                            0.0,
                            0.5884463,
                            0.03182643,
                            0.0053980704,
                            0.0,
                            0.021310033,
                            1.0083777,
                            0.0,
                            0.638678,
                            0.07527122,
                            0.0,
                            0.0,
                            0.0,
                            0.19120191,
                            0.0,
                            0.0,
                            1.3124559,
                            0.0,
                            0.0,
                            3.9229202,
                            0.011736926,
                            0.018678706,
                            0.49670547,
                            0.0,
                            0.076779366,
                            0.0,
                            3.278205,
                            1.0883224,
                            0.51861876,
                            0.0,
                            0.61675817,
                            0.0,
                            0.13538623,
                            0.0,
                            0.024089303,
                            0.0987598,
                            0.0,
                            0.12655689,
                            0.12720045,
                            0.12749231,
                            0.12724002,
                            0.12743045,
                            0.12754302,
                            0.12646867,
                            0.12609169,
                            0.12700611,
                            0.1275152,
                            0.12708259,
                            18.400589,
                            0.12678066,
                            0.1272125,
                            0.1258352,
                            0.0,
                            0.11419263,
                            0.127456,
                            0.12449172,
                            0.07755206,
                            0.12683757,
                            0.12718233,
                            0.1274646,
                            0.12313316,
                            0.12488028,
                            0.12696385,
                            0.12434611,
                            100.0,
                            0.11440916,
                            0.1274922,
                            0.12698561,
                            0.12759663,
                            0.12699622,
                            0.13351393,
                            0.5338427,
                            0.12683676,
                            0.12702267,
                            0.12683627,
                            0.13160984,
                            0.12759176,
                            0.49138507,
                            0.12748179,
                            0.12683652,
                            0.12750131,
                            0.12683508,
                            0.12712969,
                            0.12769459,
                            0.12696794,
                            0.7308832,
                            0.12709936,
                            2.7714436,
                            0.12752949,
                            0.12745953,
                            0.12672634,
                            0.12687346,
                            0.12673177,
                            0.12710728,
                            1.0872523,
                            0.12692422,
                            0.4102967,
                            0.12712122,
                            0.12710686,
                            0.12702219,
                            0.1272067,
                            0.12703896,
                            0.12187084,
                            1.0050019,
                            0.12613235,
                            5.981428,
                            0.12768595,
                            0.12399256,
                            0.12552376,
                            0.975704,
                            0.12743565,
                            0.12423678,
                            0.12716605,
                            0.12750724,
                            0.12716103,
                            0.1225029,
                            0.12706882,
                            0.12753527,
                            0.12677158,
                            0.12683652,
                            0.12495017,
                            0.12682891,
                            0.12724246,
                            0.12712812,
                            -0.0,
                            -6.520796,
                            -0.0,
                            -0.0,
                            -22.078718,
                            -0.77679986,
                            -1.0017458,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.8127077,
                            -0.0,
                            -0.2148231,
                            -0.0,
                            -5.435011,
                            -0.0,
                            -1.9724675,
                            -0.0,
                            -3.227639,
                            -0.5731972,
                            -0.0,
                            -0.12971427,
                            -0.0,
                            -1.3683605,
                            -0.0,
                            -0.0,
                            -3.9085963,
                            -19.010172,
                            -0.0,
                            -2.552213,
                            -0.0,
                            -0.4155175,
                            -0.0,
                            -0.0,
                            -2.3445225,
                            -0.7557248,
                            -0.0,
                            -0.0,
                            -0.0,
                            -18.434307,
                            -11.671213,
                            -0.0,
                            -2.770527,
                            -0.95314777,
                            -0.0,
                            -1.5481621,
                            -3.765359,
                            -0.60086054,
                            -0.021760106,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.17518,
                            -3.0509503,
                            -15.948867,
                            -0.0,
                            -3.2975776,
                            -0.0,
                            -0.0,
                            -0.49093485,
                            -0.8261002,
                            -0.0,
                            -2.1709728
                        ],
                        "type": "FLOATS"
                    },
                    {
                        "name": "kernel_params",
                        "floats": [
                            0.00397,
                            0.0,
                            3.0
                        ],
                        "type": "FLOATS"
                    },
                    {
                        "name": "kernel_type",
                        "s": "UkJG",
                        "type": "STRING"
                    },
                    {
                        "name": "post_transform",
                        "s": "Tk9ORQ==",
                        "type": "STRING"
                    },
                    {
                        "name": "prob_a",
                        "floats": [
                            -3.7815337,
                            -2.247267,
                            -2.145695,
                            -4.56935,
                            -3.090165,
                            -2.6462874
                        ],
                        "type": "FLOATS"
                    },
                    {
                        "name": "prob_b",
                        "floats": [
                            -0.046671964,
                            -0.50223184,
                            0.48904192,
                            -0.08603872,
                            0.043385465,
                            -0.18629281
                        ],
                        "type": "FLOATS"
                    },
                    {
                        "name": "rho",
                        "floats": [
                            -2.489981,
                            -3.1091208,
                            -33.915363,
                            -0.3604028,
                            0.948857,
                            0.8727817
                        ],
                        "type": "FLOATS"
                    },
                    {
                        "name": "support_vectors",
                        "floats": [
                            0.031111555,
                            0.4326574,
                            -0.41979504,
                            0.16432706,
                            0.14994457,
                            -0.25073862,
                            0.27015364,
                            -0.022865953,
                            0.3591579,
                            0.7020754,
                            0.2857259,
                            0.9413735,
                            -0.24793547,
                            0.022604197,
                            -0.7894612,
                            -0.7103321,
                            -0.3599857,
                            -0.34691405,
                            -0.05262086,
                            -0.01946384,
                            -0.15829273,
                            -0.3367185,
                            -0.35247102,
                            -0.4369471,
                            0.025431247,
                            -0.0057459264,
                            0.004700012,
                            -0.024755266,
                            -0.0062046708,
                            0.0056360723,
                            0.019093677,
                            -0.011938554,
                            0.0022536821,
                            -0.019020686,
                            -0.001421528,
                            -0.03501589,
                            -0.00450018,
                            -0.0043093543,
                            -0.0052593765,
                            0.021136113,
                            0.0021192804,
                            -0.018359015,
                            -0.02139117,
                            -0.027651131,
                            -0.012654247,
                            -0.0015317396,
                            0.0396554,
                            0.011529912,
                            -0.00528378,
                            -0.0013512761,
                            0.004988975,
                            -0.01248798,
                            0.015919307,
                            -0.012060739,
                            -0.00089942326,
                            0.0116273975,
                            0.012461132,
                            0.010758985,
                            -0.0017191272,
                            -0.00028469012,
                            0.0032289275,
                            -0.008053352,
                            -0.0098961545,
                            0.016029183,
                            -0.005415207,
                            0.014230317,
                            0.010929998,
                            -0.0024998612,
                            0.0043968265,
                            0.0018899904,
                            0.009314432,
                            0.024551887,
                            -0.00037234082,
                            0.007411115,
                            0.012899999,
                            -0.03377209,
                            0.00781966,
                            -0.0101827085,
                            -0.001896033,
                            0.008819966,
                            -0.011653438,
                            0.02890171,
                            -0.02090066,
                            0.013779994,
                            0.00083369773,
                            -0.010823923,
                            0.023428041,
                            0.0012985106,
                            -0.007523752,
                            -0.01718119,
                            -0.007979098,
                            -0.0027960555,
                            -0.010695267,
                            -0.04451142,
                            0.0017302344,
                            -0.027379641,
                            -0.013556847,
                            0.021701941,
                            0.10443548,
                            0.05889599,
                            -0.014003072,
                            -0.012409461,
                            -0.005449895,
                            0.022791078,
                            -0.037571166,
                            0.040294256,
                            -0.015756685,
                            -0.037992623,
                            0.055920053,
                            -0.03915538,
                            -0.023965567,
                            -0.020454861,
                            0.08078577,
                            0.10895704,
                            -0.03427098,
                            0.105264954,
                            -0.14039236,
                            0.010141225,
                            -0.0033093502,
                            0.016229022,
                            -0.007701618,
                            -0.11595125,
                            -0.05408968,
                            -0.027100656,
                            0.19958586,
                            0.19951521,
                            -0.14896499,
                            -0.075831175,
                            0.025192542,
                            -0.13769923,
                            -0.04553667,
                            -0.10811909,
                            -0.0722356,
                            0.008273127,
                            0.1826493,
                            -0.028215857,
                            0.06148622,
                            -0.011991417,
                            -0.024812058,
                            0.11621219,
                            0.10233859,
                            0.013121824,
                            -0.05010874,
                            -0.0015052002,
                            0.015424736,
                            0.0006031336,
                            0.07196939,
                            -0.0005384372,
                            -0.020094002,
                            -0.027897099,
                            0.04749336,
                            0.0161402,
                            -0.014534158,
                            -0.060772784,
                            -0.024005344,
                            -0.07391484,
                            -0.041762155,
                            -0.057197,
                            -0.029583948,
                            0.015953373,
                            0.003211773,
                            0.07507239,
                            0.02112805,
                            -0.041087363,
                            -0.09009057,
                            0.037137333,
                            -0.06971458,
                            0.019911861,
                            -0.0445143,
                            -0.042990893,
                            0.0033150099,
                            0.11982444,
                            -0.0006908509,
                            0.11981527,
                            -0.10420736,
                            0.051495153,
                            0.020821026,
                            -0.0047996733,
                            0.013560026,
                            -0.020813258,
                            -0.030013235,
                            -0.07608762,
                            -0.11113685,
                            -0.0366764,
                            0.037316035,
                            0.0024504077,
                            -0.18475622,
                            -0.11906482,
                            -0.006480406,
                            -0.04929656,
                            -0.030585997,
                            0.00085997325,
                            0.0013807338,
                            -0.034672707,
                            -0.046478797,
                            -0.02663398,
                            0.011075646,
                            0.00881409,
                            0.045021694,
                            -0.08853084,
                            -0.020075014,
                            0.088189304,
                            -0.033702094,
                            0.030299451,
                            0.007293349,
                            0.003665622,
                            -0.027797086,
                            0.027098833,
                            -0.05122677,
                            0.007554691,
                            0.025013398,
                            0.052505262,
                            0.025823558,
                            0.015755929,
                            0.046414834,
                            -0.025555087,
                            0.0012590318,
                            0.005981194,
                            -0.04672595,
                            0.03702372,
                            -0.0067861043,
                            -0.027261015,
                            0.003867745,
                            -0.0002316994,
                            -0.006202054,
                            -0.014474604,
                            -0.0026115172,
                            0.013970914,
                            -0.025726609,
                            -0.06969922,
                            -0.006555669,
                            -0.020322906,
                            0.013894005,
                            0.0044091474,
                            -0.012501467,
                            -0.0029450813,
                            -0.0053935433,
                            -0.050953157,
                            0.03553025,
                            -0.016896134,
                            0.0100007495,
                            0.08496258,
                            0.07335132,
                            -0.064872466,
                            0.14741895,
                            0.35290724,
                            -0.16262579,
                            0.15716302,
                            0.12802052,
                            -0.04051839,
                            0.06291995,
                            -0.051874578,
                            0.58979726,
                            0.20119634,
                            -0.1866539,
                            -0.28703418,
                            -0.08725241,
                            0.08130009,
                            -0.22349791,
                            -0.19837378,
                            -0.31636697,
                            0.32373402,
                            -0.27513763,
                            -0.29862836,
                            0.007842381,
                            -0.0010011932,
                            0.014141465,
                            -0.0015948499,
                            -0.00815077,
                            -0.0091784885,
                            0.0058306437,
                            0.006574854,
                            0.0075185895,
                            -0.0008947535,
                            0.0013849685,
                            -0.0057026935,
                            0.009909044,
                            -0.005855046,
                            0.00010249746,
                            -0.0047692107,
                            -0.0045025493,
                            0.013265351,
                            -0.013312077,
                            0.004672338,
                            -0.0014670696,
                            -0.0035775278,
                            0.004885501,
                            -0.017364424,
                            -1.5682468,
                            -0.45585224,
                            0.04509413,
                            -0.7388218,
                            -2.9889765,
                            0.7613086,
                            -1.6208024,
                            -0.33792555,
                            0.24997096,
                            -0.55289036,
                            0.7437855,
                            1.7469162,
                            0.36453733,
                            -0.37009826,
                            -1.7617662,
                            -0.6557914,
                            -0.005211358,
                            -0.24940126,
                            0.5705606,
                            -0.31285238,
                            -1.401842,
                            -0.88427305,
                            -0.85938215,
                            0.8802193,
                            0.0590442,
                            0.08769744,
                            0.3665205,
                            -0.16815813,
                            0.08230814,
                            -0.07562913,
                            -0.23030497,
                            -0.09226353,
                            -0.07714514,
                            0.04100322,
                            0.039498553,
                            -0.0011001435,
                            0.054418992,
                            -0.16668364,
                            0.14160948,
                            0.07312322,
                            0.022771144,
                            0.07101544,
                            0.10744444,
                            0.3103263,
                            -0.10325729,
                            0.12781002,
                            -0.01250367,
                            0.06796264,
                            -0.024927638,
                            -0.012042017,
                            -0.059683554,
                            -0.030277306,
                            -0.028786728,
                            -0.022938417,
                            0.014826703,
                            0.0036840953,
                            0.010773226,
                            -0.048901416,
                            -0.0129104145,
                            -0.027214877,
                            -0.021322083,
                            0.021513706,
                            -0.013584662,
                            0.037666116,
                            0.0017802316,
                            0.033932388,
                            0.024326773,
                            -0.026573462,
                            -0.058802918,
                            -0.027299765,
                            0.0014344612,
                            0.004600923,
                            0.026668148,
                            -0.01955441,
                            -0.24659531,
                            0.08622993,
                            -0.021860095,
                            0.05277045,
                            -0.020802846,
                            0.018019436,
                            0.0071220538,
                            0.026180062,
                            -0.06534907,
                            -0.020470453,
                            0.016306402,
                            0.03809106,
                            -0.09713153,
                            -0.117375374,
                            0.0042753094,
                            0.0132072205,
                            -0.021368984,
                            0.13078865,
                            -0.06445336,
                            0.021011181,
                            0.01577117,
                            0.005187238,
                            -4.8505716,
                            -7.7331777,
                            -2.6441147,
                            3.0833704,
                            3.37382,
                            -3.5466769,
                            7.897871,
                            3.4518661,
                            -1.4664474,
                            -10.23366,
                            -13.758471,
                            -1.5913416,
                            4.5003366,
                            4.5421476,
                            -3.8864498,
                            5.640585,
                            -3.1731083,
                            -1.2314116,
                            -1.106532,
                            -14.742302,
                            1.9518907,
                            1.2849886,
                            5.912637,
                            -4.555765,
                            -0.55164945,
                            4.8368373,
                            -3.4242368,
                            0.8530428,
                            3.1510334,
                            -1.2334149,
                            2.5700374,
                            2.2762158,
                            -7.899738,
                            2.1148882,
                            6.0291715,
                            2.653293,
                            3.857875,
                            0.3086044,
                            -4.2185636,
                            -3.8438022,
                            2.811248,
                            2.1956959,
                            1.410815,
                            1.0072688,
                            -2.666291,
                            -2.7142906,
                            0.7113761,
                            -3.2471852,
                            -1.0831211,
                            9.656005,
                            -3.3799386,
                            -15.175779,
                            -8.398146,
                            -4.5047903,
                            15.903966,
                            13.39822,
                            -1.9733925,
                            10.058324,
                            -14.651022,
                            -5.2983136,
                            8.812017,
                            -7.6317015,
                            3.342127,
                            2.6023846,
                            -2.490987,
                            -4.3555837,
                            -11.712974,
