{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.13",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "SVM02"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.034817234,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.055167165,
                            0.296913,
                            0.0,
                            0.0,
                            0.407222,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.56040233,
                            0.0,
                            0.0,
                            0.075098924,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.2649678,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.4468937,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.09693104,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.35919878,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.08034658,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.4195993,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.2768806,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.23222166,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.031095363,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.21973611,
                            0.0,
                            1.1382369,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.07351143,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.2110959,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.2732561,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.014005773,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.13251281,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.07995958,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.4571112,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.08164166,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.46096435,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.1276655,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.9148723,
                            0.0,
                            0.0,
                            0.48229042,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.047927752,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.31346217,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.1521118,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.06687122,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.006309691,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.3032518,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.19565849,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.021664163,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.11268458,
                            0.0,
                            0.29438335,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            -1.8446393,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.8145735,
                            -1.6236277,
                            -1.4164948,
                            -1.5846369,
                            -0.0,
                            -0.0,
                            -1.4890379,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7677221,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.2782081,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.16469283,
                            -0.0,
                            -0.40760562,
                            -0.0,
                            -0.7547834,
                            -0.3740689,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.84650296,
                            -0.3045905,
                            -0.0,
                            -0.64447683,
                            -0.9397617,
                            -0.9130892,
                            -0.0,
                            -1.0456434,
                            -0.004702247,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5039238,
                            -1.4290578,
                            -0.0,
                            -1.3839321,
                            -0.0,
                            -0.0,
                            -1.7666485,
                            -1.7442234,
                            -0.46634588,
                            -0.0,
                            -0.33182564,
                            -0.0,
                            -0.0,
                            -1.7710229,
                            -1.4298512,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.72153634,
                            -0.31898713,
                            -0.0,
                            -1.0753803,
                            -0.0,
                            -0.28739563,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.3119957,
                            -0.20259702,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.6629419,
                            -0.27470687,
                            -1.71527,
                            -0.31343824,
                            -0.0,
                            -1.2588893,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.69770956,
                            -0.21450894,
                            -1.4121708,
                            -0.0,
                            -1.3908969,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.40462,
                            -0.0,
                            -0.08938191,
                            -0.0,
                            -0.13431075,
                            -0.70247,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5203866,
                            -0.58737785,
                            -0.16654037,
                            -0.0,
                            -0.9714395,
                            -1.27984,
                            -1.4445192,
                            -0.0,
                            -0.2753001,
                            -0.24446324,
                            -0.0,
                            -0.18988994,
                            -0.0,
                            -1.8970858,
                            -0.0,
                            -0.038315173,
                            -1.2750233,
                            -1.5505369,
                            -0.27875164,
                            -0.0,
                            -0.0,
                            -1.2075188,
                            -0.01864247,
                            -0.0,
                            -3.0547724,
                            -0.0,
                            -1.883703,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.03149417,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.15440609,
                            -0.0,
                            -0.0023493438,
                            -0.21931396,
                            -0.0,
                            -0.8918366,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.20959936,
                            -1.6494366,
                            -0.47255108,
                            -0.0,
                            -0.0,
                            -0.9486378,
                            -1.4665861,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2615854,
                            -1.6964301,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5950645,
                            -1.5911182,
                            -1.0435748,
                            -0.0,
                            -0.0,
                            -0.6110752,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6871522,
                            -0.011571382,
                            -0.8303102,
                            -1.0152245,
                            -0.9353725,
                            -0.0,
                            -0.13279709,
                            -0.0,
                            -0.0,
                            -3.6860063,
                            -0.7292774,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9170852,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9897028,
                            -0.69211537,
                            -0.0,
                            -0.089025885,
                            -0.0,
                            -0.0,
                            -0.7857812,
                            -0.0,
                            -0.0,
                            -0.97838044,
                            -0.0,
                            -0.6744516,
                            -0.0,
                            -1.2787427,
                            -0.32456762,
                            -0.08394181,
                            -1.9626864,
                            -0.0,
                            -0.35504025,
                            -0.6199888,
                            -1.0309223,
                            -0.6553189,
                            -0.65497947,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0239307,
                            -0.0,
                            -0.0,
                            -0.9393337,
                            -0.0,
                            -1.3488266,
                            -1.0027136,
                            -0.0,
                            -0.28311142,
                            -0.0,
                            -0.0,
                            -0.6334823,
                            -1.4385366,
                            -0.24861656,
                            -0.0,
                            -0.6358523,
                            -0.43955612,
                            -0.0,
                            -0.0,
                            -0.4048198,
                            -1.5238541,
                            -0.0,
                            -0.18055458,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.39399067,
                            -0.28777143,
                            -1.096384,
                            -4.4124603,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.51020986,
                            -0.16149463,
                            -0.3087208,
                            -0.0,
                            -0.0,
                            -1.044116,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2429724,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9609877,
                            -1.1581119,
                            -0.12514299,
                            -0.9573873,
                            -0.0,
                            -0.0,
                            -1.7038136,
                            -0.0,
                            -0.0,
                            -0.42979595,
                            -0.64201164,
                            -1.051134,
                            -0.0,
                            -0.93893236,
                            -0.5528893,
                            -0.7227176,
                            -0.49827653,
                            -0.0,
                            -0.995633,
                            -0.0,
                            -2.3431613,
                            -0.1600663,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.47220647,
                            -0.79380536,
                            -0.68963003,
                            -1.3169042,
                            -0.0,
                            -0.19437394,
                            -1.6937493,
                            -0.23354036,
                            -0.0,
                            -0.0,
                            -0.7753531,
                            -0.2577243,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.1711825,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.0321398,
                            -1.8547026,
                            -1.3246458,
                            -0.0,
                            -0.6084775,
                            -1.0765219,
                            -0.0015624932,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.035164483,
                            -0.0,
                            -0.7267226,
                            -1.2399127,
                            -0.0,
                            -0.77433604,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5725962,
                            -0.0,
                            -0.8342773,
                            -0.0,
                            -1.222201,
                            -0.0,
                            -0.0,
                            -1.4798883,
                            -0.0,
                            -0.0,
                            -0.6327922,
                            -1.1221313,
                            -0.0,
                            -0.23587726,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.76595515,
                            -0.09790831,
                            -0.0,
                            -0.3105944,
                            -0.0,
                            -0.0,
                            -0.5070311,
                            -0.0,
                            -0.0,
                            -0.26509047,
                            -0.5917788,
                            -1.7932922,
                            -0.0,
                            -0.0,
                            -0.9115698,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.43334016,
                            -0.0,
                            -0.0,
                            -0.9348663,
                            -0.39160824,
                            -0.41034508,
                            -1.0658789,
                            -0.0,
                            -1.3657575,
                            -0.0,
                            -0.0,
                            -0.12288008,
                            -0.49445057,
                            -0.13654841,
                            -0.0,
                            -0.8639553,
                            -0.0,
                            -1.1381054,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.023512697,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.25380164,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6319351,
                            -0.0,
                            -1.1170927,
                            -0.0826434,
                            -0.5096717,
                            -0.0,
                            -1.3301786,
                            -12.863033,
                            -0.4303943,
                            -0.0,
                            -0.0,
                            -0.081860475,
                            -0.37307894,
                            -0.9260314,
                            -0.84918,
                            -0.0,
                            -0.024571398,
                            -0.0,
                            -0.0,
                            -1.0045216,
                            -0.6909917,
                            -0.75188124,
                            -0.0,
                            -0.90905106,
                            -0.50995684,
                            -0.0,
                            -0.0,
                            -0.5093333,
                            -1.0307267,
                            -0.20739608,
                            -0.038625516,
                            -0.49209216,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5877411,
                            -0.0,
                            -0.0,
                            -2.5926774,
                            -0.88401735,
                            -0.7891191,
                            -0.0,
                            -0.3709239,
                            -0.0,
                            -0.0,
                            -2.837943,
                            -0.0,
                            -0.083865866,
                            -0.0,
                            -0.8484467,
                            -0.11302766,
                            -0.0,
                            -0.65641683,
                            -0.0,
                            -0.0,
                            -0.89168775,
                            -0.33584708,
                            -0.096645616,
                            -1.0025872,
                            -0.0,
                            -0.76105714,
                            -0.90301955,
                            -0.32534647,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.263057,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.035811815,
                            -0.282537,
                            -0.59291905,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6670243,
                            -0.53005713,
                            -0.0,
                            -0.8680452,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.1190376,
                            -0.0,
                            -0.5228686,
                            -0.3982452,
                            -0.0,
                            -0.0,
                            -0.5789885,
                            -0.0,
                            -0.5113766,
                            -0.84097606,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0880622,
                            -0.0,
                            -0.0,
                            -0.4931257,
                            -0.5336503,
                            -0.08014398,
                            -0.0,
                            -0.02002923,
                            -0.0,
                            -0.4068117,
                            -0.0,
                            -0.0,
                            -0.8771937,
                            -0.16049694,
                            -0.77854383,
                            -0.16760324,
                            -0.17272456,
                            -0.3190379,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2104048,
                            -0.39924043,
                            -1.5342202,
                            -0.0,
                            -0.0,
                            -1.8846084,
                            -1.090364,
                            -0.4691219,
                            -0.4253482,
                            -0.21862046,
                            -0.8201881,
                            -0.0,
                            -0.7879141,
                            -0.782572,
                            -0.0,
                            -0.5536723,
                            -0.36833212,
                            -0.0,
                            -1.0014676,
                            -0.41237444,
                            -0.009282541,
                            -0.0,
                            -1.9772892,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9126912,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.04331055,
                            -0.9265711,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.79485863,
                            -0.0,
