{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.8.0",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "probabilities"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0,
                            17.069592,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            5.0473523,
                            0.0,
                            4.59067,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.9091854,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            8.099158,
                            0.0,
                            0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.09557698,
                            -0.0,
                            -1.7194442,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.9197273,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.8025496,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.4881294,
                            -0.0,
                            -1.270534,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.25087366,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.124355,
                            -0.0,
                            -3.0719151,
                            -0.0,
                            -0.0,
                            -0.10480488,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.9062018,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2601937,
                            -1.4746444,
                            -0.0,
                            -0.0,
                            -2.6760726,
                            -0.0,
                            -3.3737867,
                            -0.0,
                            -0.0,
                            -0.09319529,
                            -0.0,
                            -0.0,
                            -1.4504626,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.6793779,
                            -0.0,
                            -0.0,
                            -0.08611547,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.19292007,
                            -0.0,
                            -0.0,
                            -2.7141082,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.14756612,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.81340444,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.7870755,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -13.295371,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.5781958,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.6626153,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.8411403,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -35.875805,
                            -0.0,
                            -0.0,
                            -0.0,
                            -55.632,
                            -100.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -74.47531,
                            -22.285002,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -32.120174,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -20.225739,
                            -58.70513,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -87.14509,
                            -0.0,
                            -0.0,
                            -75.40445,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -34.5447,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -35.662933,
                            -0.0,
                            -2.0626285,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -54.582855,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -67.20164,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -19.39112,
                            -0.0,
                            -0.0,
                            -84.694275,
                            -0.0,
                            -0.3097414,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -28.044456,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -45.775223,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -39.516945,
                            -0.0,
                            -0.0,
                            -0.0,
                            -12.950174,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -32.04722,
                            -0.0,
                            -37.816593,
                            -0.0,
                            -0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            23.642258,
                            0.0,
                            63.404034,
                            0.0,
                            0.0,
                            4.4665136,
                            0.0,
                            1.7488493,
                            0.0,
                            0.0,
                            15.817531,
                            0.0,
                            0.0,
                            13.648337,
                            0.0,
                            0.0,
                            100.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            5.4368763,
                            0.0,
                            0.0,
                            0.3632211,
                            1.3211781,
                            1.4427481,
                            4.234234,
                            0.9116549,
                            5.271047,
                            1.4417323,
                            1.198695,
                            0.6964397,
                            1.5631295,
                            2.6442509,
                            1.0843712,
                            2.949055,
                            0.0,
                            0.3081871,
                            1.2748446,
                            0.97030777,
                            0.0,
                            1.1677611,
                            0.0,
                            5.628306,
                            2.0349426,
                            1.0659097,
                            0.49858055,
                            0.0,
                            0.5570253,
                            0.69515693,
                            1.2566024,
                            0.75397474,
                            1.2604936,
                            0.8852739,
                            0.5577867,
                            1.5122591,
                            0.8347785,
                            0.0,
                            0.8675043,
                            3.4341133,
                            1.3988196,
                            1.9010003,
                            1.3756026,
                            1.4765368,
                            0.76906323,
                            0.91960776,
                            1.7310305,
                            5.470825,
                            2.420352,
                            1.3252064,
                            1.8289825,
                            2.7182117,
                            0.14512376,
                            2.1026642,
                            1.2072992,
                            0.8219654,
                            0.5232635,
                            0.4889746,
                            1.0615579,
                            1.9121777,
                            6.305669,
                            0.0,
                            1.2561135,
                            5.037371,
                            0.0,
                            0.88331133,
                            0.32090932,
                            0.48449957,
                            0.6566306,
                            0.74069583,
                            1.0159374,
                            0.7710186,
                            0.4639402,
                            0.13173527,
                            1.2398863,
                            6.9177694,
                            4.6296706,
                            0.8636277,
                            1.0013294,
                            2.778901,
                            0.0,
                            6.413244,
                            0.46102634,
                            0.91352814,
                            0.0,
                            1.1939545,
                            0.69397163,
                            9.976162,
                            1.1957294,
                            1.1628911,
                            2.093063,
                            1.3257177,
                            0.27187517,
                            4.5967517,
                            0.8437309,
                            1.4874119,
                            0.0,
                            1.5870513,
                            1.6017591,
                            0.4458609,
                            1.3909994,
                            0.29069185,
                            1.4986649,
                            0.7644679,
                            0.6391668,
                            1.0466787,
                            0.91675925,
                            1.3966872,
                            1.1004254,
                            0.7612699,
                            1.3160765,
                            1.1455367,
                            4.4392962,
                            1.5034373,
                            1.4522041,
                            1.2976567,
                            1.3505119,
                            2.5236304,
                            0.75922036,
                            0.0,
                            0.4720353,
                            4.7118926,
                            0.8283537,
                            0.5303902,
                            1.28077,
                            1.11343,
                            0.98938125,
                            0.13376758,
                            -0.24115641,
                            -0.36644843,
                            -0.30449966,
                            -0.4242838,
                            -0.42547545,
                            -0.4253265,
                            -0.42601368,
                            -1.2028494,
                            -0.42532322,
                            -0.42166162,
                            -1.824769,
                            -0.41283032,
                            -0.4132791,
                            -0.4257041,
                            -0.37410676,
                            -0.33826092,
                            -0.49039802,
                            -0.42451006,
                            -3.1960573,
                            -0.28002602,
                            -0.21500626,
                            -0.28333983,
                            -0.3576579,
                            -0.4257589,
                            -0.4266569,
                            -0.42139238,
                            -0.42290878,
                            -0.2480175,
                            -0.29004222,
                            -0.423144,
                            -0.41404858,
                            -1.4649153,
                            -2.9741936,
                            -0.42577663,
                            -0.2756846,
                            -0.3710611,
                            -0.40342999,
                            -0.40263012,
                            -0.3114038,
                            -0.4249165,
                            -0.058775894,
                            -0.4158003,
                            -0.33470964,
                            -0.3768038,
                            -0.36542815,
                            -0.35925496,
                            -0.42109498,
                            -1.5787143,
                            -0.40342543,
                            -0.22250758,
                            -0.40144917,
                            -0.42281288,
                            -0.41854164,
                            -0.2052392,
                            -0.41588745,
                            -0.3661895,
                            -0.5394326,
                            -0.08002285,
                            -0.42223367,
                            -0.30621228,
                            -0.42535427,
                            -0.4957595,
                            -0.33332446,
                            -0.14735955,
                            -0.3780417,
                            -0.41304678,
                            -0.41574854,
                            -0.42088047,
                            -0.3709195,
                            -1.1011972,
                            -0.41173345,
                            -0.4191323,
                            -0.48086858,
                            -0.22071752,
                            -0.41255254,
                            -0.31692284,
                            -2.3142307,
                            -0.41033068,
                            -2.4587958,
                            -0.42537683,
                            -0.4254871,
                            -0.34637702,
                            -0.42550525,
                            -0.42434445,
                            -0.42497328,
                            -1.8036927,
                            -0.42532632,
                            -0.33682784,
                            -0.41951632,
                            -0.29244697,
                            -0.3891929,
                            -0.4096332,
                            -0.2996027,
                            -0.36178854,
                            -0.4110624,
                            -0.42534545,
                            -0.3049854,
                            -0.40639484,
                            -0.38855222,
                            -1.9287752,
                            -0.39753962,
                            -0.261996,
                            -0.42581216,
                            -30.089754,
                            -0.7216855,
                            -0.38024342,
                            -8.30355,
                            -1.1405215,
                            -0.39702,
                            -0.34357074,
                            -0.4487684,
                            -0.27573612,
                            -0.72315973,
                            -0.4248003,
                            -0.38587022,
                            -0.41533336,
                            -0.4258756,
                            -0.42534545,
                            -0.42354667,
                            -1.0969924,
                            -0.42305225,
                            -10.064229,
                            -0.42072842,
                            -0.2623575,
                            -1.2309667,
                            -0.4081216,
                            -0.42527336,
                            -0.42034972,
                            -0.59404325,
                            -0.26325586,
                            -0.41337195,
                            -0.4253626,
                            -0.43317953,
                            -0.1789699,
                            -0.42502916,
                            -0.425301,
                            -0.42107004,
                            -0.36296856,
                            -0.4250739,
                            -0.34919748,
                            -0.42496157,
                            -0.4247244,
                            -0.35127407,
                            -0.3418837,
                            -0.19542272,
                            -0.257096,
                            -0.42548764,
                            -0.26833633,
                            -0.34690365,
                            -0.4080518,
                            -0.41171974,
                            -0.42536488,
                            -0.42529324,
                            -13.176491,
                            -0.34052163,
                            -1.9335202,
                            -0.40392533,
                            -1.707966,
                            -0.17407067,
                            -0.16815253,
                            -0.4116215,
                            -0.3652391,
                            -0.78853077,
                            -0.26930666,
                            -0.37945694,
                            -0.42162243,
                            -0.3227046,
                            -0.4203044,
                            -0.41469443,
                            -0.4234507,
                            -0.42579246,
                            -0.41042036,
                            -0.42515668,
                            -0.42529646,
                            -0.36322996,
                            -0.42552343,
                            -0.39350045,
                            -0.123635195,
                            -0.42532507,
                            -0.270972,
                            -0.42595458,
                            -0.3407026,
                            -3.7414937,
                            -0.39457756,
                            -7.8152075,
                            -0.18238534,
                            -0.22330667,
                            -0.41909504,
                            -0.4132719,
                            -0.40979886,
                            -0.4172442,
                            -0.4193559,
                            -0.95523566,
                            -0.4127066,
                            -0.42160982,
                            -0.4030246,
                            -0.24818324,
                            -11.231602,
                            -2.9056482,
                            -0.4939307,
                            -0.35771236,
                            -3.9504879,
                            -0.36579672,
                            -0.40053347,
                            -0.23863696,
                            -0.363482,
                            -0.39139372,
                            -0.0,
                            -2.0774086,
                            -1.7569691,
                            -1.1998063,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.1061897,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.8819363,
                            -0.0,
                            -0.0,
                            -5.170372,
                            -1.5710006,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7039481,
                            -0.0,
                            -4.7593393,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.0489635,
                            -0.18888807,
                            -0.0,
                            -0.70211494,
                            -0.0,
                            -0.82635146,
                            -2.503918,
                            -8.743472,
                            -0.0,
                            -3.6861744,
                            -0.0,
                            -0.7315113,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5621045,
                            -2.49808,
                            -0.0,
                            -0.0,
                            -3.1896985,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.3613623,
                            -0.0,
                            -0.0,
                            -0.9237627,
                            -0.0,
                            -1.117406,
                            -4.107429,
                            -1.2128514,
                            -5.761654,
                            -0.0,
                            -2.2101183,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.2734651,
                            -1.294351,
                            -0.10933487,
                            -1.4672171,
                            -0.09712653,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.0239897,
                            -0.05752646,
                            -1.4133602,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.20828488,
                            -0.9729786,
                            -1.666646,
                            -0.0,
                            -1.8071653,
                            -0.0,
                            -0.0,
                            -0.93121654,
                            -3.6430337,
                            -0.0,
                            -0.0,
                            -1.3861638,
                            -1.2932914,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.1223962,
                            -0.9185217,
                            -1.3876573,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.0765762,
                            -0.0,
                            -0.0,
                            -2.5439856,
                            -0.0,
                            -3.4427998,
                            -0.0,
                            -2.5718226,
                            -7.396452,
                            -1.1391978,
                            -0.0,
                            -0.0,
                            -1.7089785,
                            -2.307684,
                            -2.182588,
                            -0.0,
                            -0.0,
                            -0.2885634,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7659996,
                            -0.0,
                            -0.96930677,
                            -0.0,
                            -1.9599121,
                            -3.614951,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            0.0,
                            100.0,
                            0.0,
                            100.0,
                            100.0,
                            0.0,
                            100.0,
                            32.654724,
                            100.0,
                            44.13755,
                            0.0,
                            100.0,
                            100.0,
                            30.421251,
                            100.0,
                            100.0,
                            21.639853,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            71.2653,
                            100.0,
                            100.0,
                            24.104546,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            60.283195,
                            100.0,
                            100.0,
                            71.96278,
                            100.0,
                            100.0,
                            0.0,
                            0.0,
                            0.0,
                            3.5286217,
                            0.0,
                            6.849832,
                            0.0,
                            0.0,
                            0.0,
                            1.2622709,
                            4.6663866,
                            0.0,
                            0.0,
                            0.07735826,
                            0.0,
                            0.0,
                            0.0,
                            0.29739857,
                            0.0,
                            0.41694945,
                            6.715835,
                            1.6539955,
                            0.0,
                            0.05970901,
                            1.2217767,
                            0.0,
                            0.0,
                            0.22053584,
                            2.9147818,
                            0.38729396,
                            0.36673862,
                            0.0,
                            0.95781255,
                            0.0,
                            0.18084274,
                            0.035373565,
                            1.8820527,
                            0.054333076,
                            0.0,
                            0.0,
                            0.37004784,
                            0.0,
                            3.4352016,
                            0.35401326,
                            5.7919993,
                            2.4638305,
                            0.0600114,
                            0.84712493,
                            1.0243999,
                            0.0,
                            0.8979713,
                            0.011614054,
                            0.67433137,
                            0.18456848,
                            0.3622171,
                            0.0,
                            1.7799715,
                            7.6709085,
                            0.44805396,
                            2.10522,
                            0.0,
                            0.19361377,
                            0.4311861,
                            0.0,
                            1.1753105,
                            0.89044166,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.4115993,
                            2.747566,
                            4.334969,
                            0.0,
                            0.56637144,
                            8.097397,
                            4.0488114,
                            9.421644,
                            0.0,
                            0.0,
                            3.679456,
                            0.0,
                            0.0,
                            10.863965,
                            0.15965337,
                            0.0,
                            0.0,
                            0.090630926,
                            0.051917337,
                            4.8753033,
                            0.0,
                            0.0,
                            2.2030663,
                            0.0,
                            0.062136643,
                            0.0,
                            0.039692603,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.03476301,
                            0.23582287,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            5.5769906,
                            0.0,
                            0.12160364,
                            0.0,
                            0.30901858,
                            0.228534,
                            0.0,
                            0.31375882,
                            0.2962329,
                            0.9265307,
                            0.0,
                            0.0,
                            0.026004903,
                            0.0,
                            0.0,
                            0.0,
                            0.07143082,
                            0.10918211,
                            0.090275705,
                            0.12532929,
                            0.12609899,
                            0.12577237,
                            0.12620923,
                            0.09092075,
                            0.1260365,
                            0.12544805,
                            0.07913522,
                            0.122344255,
                            0.122090794,
                            0.1258703,
                            0.11068269,
                            0.10036303,
                            0.21390861,
                            0.1258544,
                            2.729657,
                            0.083646856,
                            0.063573666,
                            0.08381873,
                            0.10625074,
                            0.12599386,
                            0.12551224,
                            0.12490694,
                            0.12525016,
                            0.07400721,
                            0.08597648,
                            0.1254863,
                            0.12277718,
                            1.0920776,
                            1.6361411,
                            0.12634133,
                            0.08191976,
                            0.10999717,
                            0.1191289,
                            0.11935603,
                            0.09253066,
                            0.12554659,
                            0.0,
                            0.12317684,
                            0.099180326,
                            0.11179046,
                            0.108422466,
                            0.10659811,
                            0.12471016,
                            0.0,
                            0.1197531,
                            0.06589808,
                            0.1190411,
                            0.12488847,
                            0.12359951,
                            0.060289983,
                            0.12290593,
                            0.10827887,
                            0.14047365,
                            0.023456797,
                            0.1254844,
                            0.09114237,
                            0.12568691,
                            0.16367602,
                            0.09872082,
                            0.04333091,
                            0.11206179,
                            0.12258917,
                            0.12339171,
                            0.12423322,
                            0.10943224,
                            0.43035027,
                            0.12157384,
                            0.1239234,
                            0.13832895,
                            0.06520429,
                            0.12229212,
                            0.09366856,
                            2.212518,
                            0.121170126,
                            1.3891343,
                            0.12612692,
                            0.12565249,
                            0.102758616,
                            0.12609139,
                            0.12570104,
                            0.12611769,
                            0.16639203,
                            0.12614655,
                            0.09942301,
                            0.12433938,
                            0.08664079,
                            0.115278095,
                            0.12109015,
                            0.08892801,
                            0.1070625,
                            0.121249504,
                            0.12611805,
                            0.09072647,
                            0.12007925,
                            0.1152105,
                            0.0,
                            0.11796298,
                            0.07755208,
                            0.12612541,
                            100.0,
                            0.17477423,
                            0.11313582,
                            11.740734,
                            0.62602,
                            0.117825,
                            0.102135174,
                            0.1563752,
                            0.081815444,
                            0.05455198,
                            0.12539682,
                            0.11433168,
                            0.122860014,
                            0.12615058,
                            0.12632343,
                            0.1257962,
                            0.2234783,
                            0.12546441,
                            4.4589653,
                            0.124092266,
                            0.07819534,
                            0.1746641,
                            0.12113005,
                            0.1264781,
                            0.12478067,
                            0.43386877,
                            0.07833675,
                            0.122149564,
                            0.12622395,
                            0.13270661,
