{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.8.0",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "probabilities"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            15.671938,
                            0.0,
                            5.4154325,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            9.923595,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.05653312,
                            4.200838,
                            0.0,
                            0.0,
                            15.454093,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.28672308,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.37167764,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0014628593,
                            -2.7630002,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.15363534,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.9488533,
                            -16.180334,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.018126033,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.2451694,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.3647566,
                            -0.0,
                            -1.58247,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.9280568,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.8044338,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.13083744,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -7.2299356,
                            -0.0,
                            -2.1175768,
                            -4.65205,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7725782,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.18945804,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.55474,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -59.524197,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.1371763,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.122319,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.9345939,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6032818,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -6.0983057,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.36165604,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.6932912,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.4946679,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.31292072,
                            -0.0,
                            -0.0,
                            -0.37041235,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.2162812,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.108465746,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.74217206,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.46473977,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.14060721,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -5.051738,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -21.706982,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9728195,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -46.467052,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -23.813366,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -81.4046,
                            -100.0,
                            -0.0,
                            -0.0,
                            -12.549873,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -51.10167,
                            -100.0,
                            -0.0,
                            -16.814465,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -42.296055,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -34.85129,
                            -0.0,
                            -100.0,
                            -2.0175629,
                            -0.0,
                            -0.0,
                            -19.800955,
                            -100.0,
                            -100.0,
                            -38.37657,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -70.96397,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -56.67972,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -74.040375,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -14.896879,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -86.86628,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -57.569656,
                            -0.0,
                            -100.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -36.567062,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -43.642128,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -4.2564297,
                            -0.0,
                            -100.0,
                            -0.0,
                            -39.85436,
                            -100.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -15.7443,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -41.832752,
                            -0.0,
                            -0.0,
                            -51.047024,
                            -25.419035,
                            -0.0,
                            0.0,
                            0.0,
                            6.2563705,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            27.13177,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            32.98223,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            27.941568,
                            30.547997,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.7721082,
                            0.0,
                            0.0,
                            20.954384,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.0191529,
                            28.71951,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.154344,
                            0.9033423,
                            0.0,
                            3.2998393,
                            5.505057,
                            10.049577,
                            0.7480787,
                            1.1844538,
                            1.9398268,
                            0.0,
                            1.8820527,
                            1.2182299,
                            6.230799,
                            0.4408709,
                            1.2422773,
                            7.687705,
                            6.3008604,
                            1.651935,
                            0.43125278,
                            0.03626757,
                            0.05945221,
                            0.0,
                            6.2523527,
                            0.26237774,
                            0.9414432,
                            0.04325846,
                            1.0064275,
                            0.042503025,
                            2.817068,
                            0.91458,
                            5.8135376,
                            1.2909769,
                            2.016802,
                            0.039705575,
                            0.5236297,
                            1.4178066,
                            1.2358482,
                            4.465286,
                            2.1543164,
                            2.3271406,
                            0.0,
                            1.317904,
                            1.4738533,
                            0.9597199,
                            6.611592,
                            0.24179853,
                            0.31486562,
                            0.5853618,
                            0.31657174,
                            19.551361,
                            1.3258083,
                            0.13416594,
                            1.8319856,
                            0.803401,
                            0.7964333,
                            8.580716,
                            2.075457,
                            0.18508482,
                            1.6279205,
                            1.0266596,
                            1.9662302,
                            0.7718969,
                            1.8767009,
                            0.0,
                            11.066371,
                            25.9093,
                            0.27118814,
                            1.42357,
                            1.0925431,
                            1.2066314,
                            2.858578,
                            6.9314876,
                            0.5555314,
                            0.17596823,
                            13.98143,
                            0.3974898,
                            1.9971304,
                            2.4502516,
                            1.2064986,
                            17.881102,
                            0.0,
                            1.7578781,
                            0.48155954,
                            1.0595107,
                            3.0921707,
                            0.0,
                            1.530695,
                            1.1212559,
                            1.3521535,
                            1.0830944,
                            0.0,
                            0.0,
                            1.8104541,
                            3.578249,
                            1.1693441,
                            0.0,
                            0.16441862,
                            0.21339045,
                            8.394954,
                            12.708153,
                            0.96179986,
                            14.634971,
                            0.7053987,
                            0.0,
                            0.30002972,
                            0.4040898,
                            4.0915356,
                            3.0546691,
                            0.0,
                            1.1237911,
                            2.5928245,
                            0.0,
                            0.04085987,
                            1.0367049,
                            0.39450234,
                            1.1476494,
                            3.3363404,
                            0.28740492,
                            0.50239617,
                            0.0,
                            3.9940007,
                            0.3520665,
                            1.409696,
                            1.0745709,
                            1.3924073,
                            1.1920729,
                            1.0790064,
                            4.5656867,
                            8.641214,
                            1.1622013,
                            0.74689674,
                            1.1712528,
                            30.08648,
                            1.1083175,
                            21.617165,
                            2.5100906,
                            0.6981211,
                            0.0,
                            1.6052799,
                            5.248577,
                            0.42175552,
                            1.4743192,
                            0.90842885,
                            4.0625234,
                            0.63127553,
                            6.1685667,
                            0.38032037,
                            3.3318708,
                            1.0915911,
                            0.39182383,
                            0.6497058,
                            3.4748547,
                            0.5148006,
                            1.2837825,
                            24.674685,
                            0.60937446,
                            0.0,
                            2.3571835,
                            0.20354377,
                            1.1363358,
                            0.78886855,
                            2.8271518,
                            0.8964033,
                            3.3828847,
                            0.0,
                            3.5346074,
                            1.0077348,
                            0.4605516,
                            0.37239522,
                            1.0150377,
                            0.9419213,
                            2.0480607,
                            0.9914478,
                            0.98285925,
                            2.451604,
                            1.9849191,
                            0.5686524,
                            0.0,
                            1.2462329,
                            20.010426,
                            19.19424,
                            0.017315317,
                            2.7310278,
                            1.716027,
                            0.169385,
                            0.3019975,
                            1.6395992,
                            0.4762798,
                            1.3248206,
                            0.15171303,
                            0.0,
                            0.43060732,
                            1.2860218,
                            4.0102634,
                            0.051937632,
                            0.21792808,
                            0.6509091,
                            13.466749,
                            9.882702,
                            4.2739625,
                            0.0,
                            0.3869194,
                            0.0,
                            0.37945852,
                            0.72065955,
                            38.825356,
                            0.0,
                            1.46981,
                            1.6119168,
                            0.32511574,
                            7.3848724,
                            16.330118,
                            5.517454,
                            0.3502864,
                            0.56682706,
                            6.705696,
                            0.72261953,
                            1.1337707,
                            0.8056193,
                            0.41719377,
                            0.1679093,
                            0.0,
                            1.1604985,
                            0.30990118,
                            0.0,
                            0.40923703,
                            1.3125057,
                            0.8783192,
                            5.1317463,
                            5.2281823,
                            0.80569226,
                            1.8482962,
                            1.044692,
                            0.37749195,
                            0.0,
                            0.53856444,
                            2.7491221,
                            8.781545,
                            1.0897807,
                            0.9830494,
                            5.7877016,
                            1.4476908,
                            0.20079893,
                            0.5585982,
                            0.74470264,
                            1.1380777,
                            0.74156016,
                            1.1248488,
                            0.33762068,
                            0.56722033,
                            0.0,
                            0.0,
