{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.13",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "SVM02"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.01570124,
                            0.015765445,
                            0.015864726,
                            0.015180446,
                            0.015886616,
                            0.01565897,
                            0.016526075,
                            0.015878534,
                            0.015833855,
                            0.0158884,
                            0.016284585,
                            0.015940592,
                            0.015838327,
                            0.015776658,
                            0.015813727,
                            0.016357176,
                            0.016334737,
                            0.01591681,
                            0.01651986,
                            0.015773932,
                            0.015838582,
                            0.015855728,
                            0.0094841905,
                            0.01592812,
                            0.015940754,
                            0.015839456,
                            0.015928576,
                            0.015856262,
                            0.015839182,
                            0.015936974,
                            0.015846463,
                            0.015907284,
                            0.015569316,
                            0.015471302,
                            0.015639456,
                            0.01573349,
                            0.015672168,
                            0.015928749,
                            0.015916804,
                            0.015640562,
                            0.015859138,
                            0.009961008,
                            0.015820006,
                            0.015720958,
                            0.015937861,
                            0.015728144,
                            0.016198613,
                            0.015728163,
                            0.015884057,
                            0.01585978,
                            0.015908105,
                            0.016472137,
                            0.011808347,
                            0.015885958,
                            0.6204077,
                            0.015860947,
                            0.015893742,
                            0.015820665,
                            0.015857717,
                            0.01590793,
                            0.015700178,
                            0.015908156,
                            0.015844878,
                            0.015114855,
                            0.01585462,
                            0.015859306,
                            0.016418936,
                            0.015681533,
                            0.015557528,
                            0.01572814,
                            0.015815284,
                            0.015937917,
                            0.015934242,
                            0.015926184,
                            0.015582824,
                            0.01585373,
                            0.015821384,
                            0.015838673,
                            0.015628712,
                            0.015979169,
                            0.015171238,
                            0.016059197,
                            0.015850399,
                            0.015886113,
                            0.01586062,
                            0.013956449,
                            0.0156170735,
                            0.01594033,
                            0.015697822,
                            0.015846513,
                            0.015161307,
                            0.014308819,
                            0.015581101,
                            0.015908131,
                            0.015907735,
                            0.011750082,
                            0.015728226,
                            0.015938208,
                            0.015839716,
                            0.051611353,
                            0.015825268,
                            0.015904205,
                            0.015846457,
                            0.010772862,
                            0.015874721,
                            0.014615096,
                            0.015883965,
                            0.01578435,
                            0.015908128,
                            0.015669063,
                            0.015826618,
                            0.015606301,
                            0.015881373,
                            0.014788075,
                            0.015881985,
                            0.015886348,
                            0.015853606,
                            0.015908,
                            0.015855538,
                            0.01584065,
                            0.016339269,
                            0.015860556,
                            0.01570044,
                            0.015852975,
                            0.0158287,
                            0.015900778,
                            0.015728252,
                            0.015717119,
                            0.01570045,
                            0.015800802,
                            0.015807249,
                            0.015854992,
                            0.015902208,
                            0.015857663,
                            0.015846584,
                            0.015811665,
                            0.015615285,
                            0.015853439,
                            0.015849033,
                            0.015837016,
                            0.01531914,
                            0.01562759,
                            0.015908869,
                            0.015872478,
                            0.016284555,
                            0.0158708,
                            0.015908156,
                            0.015723787,
                            0.015833342,
                            0.015881551,
                            0.015847242,
                            0.0152142355,
                            0.011917494,
                            0.015878802,
                            0.015700264,
                            0.01593381,
                            0.015831394,
                            0.015918601,
                            0.015889524,
                            0.014479951,
                            0.015716277,
                            0.016518747,
                            0.015881225,
                            0.015809797,
                            0.015699737,
                            0.016500352,
                            0.01584019,
                            0.014877253,
                            0.015673373,
                            0.015330134,
                            0.015674321,
                            0.015882172,
                            0.01565852,
                            0.015889626,
                            0.09184278,
                            0.015816625,
                            0.015849255,
                            0.015715323,
                            0.01592477,
                            0.015956433,
                            0.01589586,
                            0.015846353,
                            0.015886392,
                            0.015883815,
                            0.015856214,
                            0.015774751,
                            0.015845584,
                            0.014682368,
                            0.015926661,
                            0.0159761,
                            0.015861398,
                            0.015889343,
                            0.020942483,
                            0.01584487,
                            0.015886227,
                            0.01588213,
                            0.015883774,
                            0.015884941,
                            0.015839847,
                            0.016327567,
                            0.01570149,
                            0.015875392,
                            0.015853984,
                            0.016285084,
                            0.015300968,
                            0.013233094,
                            0.016327238,
                            0.015929215,
                            -0.0,
                            -1.5588776,
                            -0.09015776,
                            -1.0889257,
                            -0.0,
                            -1.2379794,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5556381,
                            -0.0,
                            -0.88173574,
                            -0.0,
                            -1.0999317,
                            -0.0,
                            -0.59967285,
                            -0.81335914,
                            -0.89209133,
                            -1.0111518,
                            -1.0123465,
                            -1.4067512,
                            -0.2910215,
                            -0.7644897,
                            -0.8579731,
                            -0.029640058,
                            -0.0,
                            -0.0,
                            -1.4431033,
                            -1.1105016,
                            -0.44219404,
                            -1.1660933,
                            -0.0,
                            -0.23379222,
                            -0.92085207,
                            -1.4078352,
                            -0.39794207,
                            -1.2989819,
                            -0.0,
                            -1.001484,
                            -0.38290372,
                            -0.139849,
                            -0.7565664,
                            -0.6416919,
                            -0.5601066,
                            -0.39941376,
                            -0.002811649,
                            -1.0533969,
                            -0.0,
                            -1.3599269,
                            -1.2945,
                            -0.0,
                            -1.1040746,
                            -0.0,
                            -1.5529335,
                            -0.35495055,
                            -0.25289473,
                            -1.3622619,
                            -0.59175247,
                            -0.08613415,
                            -1.054046,
                            -1.2613112,
                            -0.0,
                            -0.6101156,
                            -1.560374,
                            -0.31690368,
                            -0.0,
                            -0.90316665,
                            -0.06505195,
                            -1.2573186,
                            -1.3755757,
                            -1.3057268,
                            -1.4332802,
                            -0.98124605,
                            -1.1139108,
                            -0.5899806,
                            -1.4988967,
                            -0.0,
                            -0.18509978,
                            -0.38337016,
                            -0.9227344,
                            -0.60930306,
                            -0.0,
                            -1.533635,
                            -0.5113725,
                            -0.0,
                            -0.6062068,
                            -0.37275752,
                            -0.0,
                            -1.4570429,
                            -0.0,
                            -1.4392695,
                            -0.0,
                            -0.9162071,
                            -0.30895445,
                            -0.0,
                            -1.2268623,
                            -0.023309166,
                            -0.21742818,
                            -1.5494674,
                            -0.8783361,
                            -1.1070007,
                            -0.23124368,
                            -0.5946649,
                            -1.5616558,
                            -0.0,
                            -0.681862,
                            -0.7909672,
                            -0.0,
                            -0.6194444,
                            -0.45681992,
                            -0.73337966,
                            -1.5600622,
                            -0.6682742,
                            -1.2660162,
                            -1.0096855,
                            -0.9004048,
                            -0.31694224,
                            -0.0,
                            -0.0,
                            -0.8475365,
                            -0.91784275,
                            -1.0474125,
                            -0.63253534,
                            -1.5505651,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5755108,
                            -0.6759356,
                            -1.4292376,
                            -1.4609977,
                            -0.0,
                            -1.294755,
                            -0.0,
                            -0.6147826,
                            -1.3719616,
                            -1.3898073,
                            -0.4036096,
                            -0.0,
                            -0.28479177,
                            -0.0,
                            -0.0,
                            -0.80541724,
                            -1.1595806,
                            -0.80129665,
                            -0.64220923,
                            -0.06799263,
                            -0.5281325,
                            -0.0,
                            -0.091145694,
                            -0.12282016,
                            -0.34563088,
                            -0.93520725,
                            -1.0503182,
                            -0.4899699,
                            -0.5367213,
                            -0.71304077,
                            -0.4108274,
                            -0.36734805,
                            -1.2082928,
                            -0.3167185,
                            -0.12859392,
                            -0.40262884,
                            -0.3280666,
                            -0.33636484,
                            -0.80870026,
                            -0.37745333,
                            -0.92949617,
                            -0.8357977,
                            -0.7734243,
                            -0.37449446,
                            -0.0,
                            -0.43076193,
                            -0.69518775,
                            -0.977778,
                            -0.40965456,
                            -0.7166398,
                            -0.49319378,
                            -0.52005833,
                            -0.8914026,
                            -0.21106978,
                            -0.78067845,
                            -0.27024692,
                            -0.5894042,
                            -0.21780612,
                            -0.0,
                            -1.0547044,
                            -0.07308012,
                            -0.88236463,
                            -0.8331319,
                            -0.24067219,
                            -0.89854527,
                            -0.005394704,
                            -0.1513078,
                            -0.5338647,
                            -0.6454756,
                            -0.4098945,
                            -0.36734882,
                            -0.8657459,
                            -0.0,
                            -1.0854002,
                            -0.16824332,
                            -0.4346842,
                            -0.0,
                            -0.6208718,
                            -0.90100724,
                            -0.12792547,
                            -0.5562528,
                            -0.0,
                            -0.46783662,
                            -0.0,
                            -0.7942575,
                            -0.9969975,
                            -0.55979836,
                            -0.4794132,
                            -0.3784669,
                            -0.27265096,
                            -1.0104707,
                            -0.0,
                            -0.5214762,
                            -0.7094374,
                            -1.113321,
                            -0.34568578,
                            -0.5582637,
                            -0.86295545,
                            -0.9780897,
                            -0.6703184,
                            -0.71048224,
                            -0.37493372,
                            -0.93425995,
                            -0.26807058,
                            -1.0577028,
                            -0.18021597,
                            -0.19429615,
                            -0.6993818,
                            -0.56847566,
                            -0.8077641,
                            -0.8037703,
                            -0.4870666,
                            -0.8909016,
                            -0.72858864,
                            -0.71571887,
                            -0.89135253,
                            -0.430655,
                            -0.7073639,
                            -0.75658244,
                            -1.0981687,
                            -0.0,
                            -0.3226065,
                            -0.0,
                            -0.2813265,
                            -0.0,
                            -0.5182606,
                            -0.514428,
                            -0.20519337,
                            -0.9953868,
                            -0.32409143,
                            -0.0,
                            -0.61122096,
                            -0.5874729,
                            -0.0,
                            -0.6758664,
                            -0.0,
                            -0.6475942,
                            -0.8721426,
                            -0.78813726,
                            -0.5228721,
                            -0.7046309,
                            -0.15307783,
                            -0.878167,
                            -0.07896111,
                            -1.0830795,
                            -0.91607296,
                            -0.9917707,
                            -0.42057326,
                            -0.28587493,
                            -0.3083059,
                            -0.5938782,
                            -0.0,
                            -0.7804154,
                            -0.6815221,
                            -0.0,
                            -0.0,
                            -0.73627985,
                            -0.84082866,
                            -1.0548851,
                            -0.06544303,
                            -0.55229867,
                            -0.105570026,
                            -0.9994866,
                            -0.8327164,
                            -1.0114409,
                            -0.9430439,
                            -1.0173804,
                            -0.31350142,
                            -0.5521079,
                            -0.07253408,
                            -0.2946699,
                            -0.77775115,
                            -0.7460537,
                            -0.5795879,
                            -0.08887579,
                            -0.50264585,
                            -0.22876525,
                            -0.88376033,
                            -0.8891618,
                            -0.0,
                            -0.5429325,
                            -0.7018498,
                            -0.5540831,
                            -0.3962642,
                            -0.24979416,
                            -0.0,
                            -0.9654207,
                            -0.41575205,
                            -0.12884882,
                            -0.46491674,
                            -0.5454809,
                            -0.6394548,
                            -1.1359909,
                            -0.002177815,
                            -0.4536179,
                            -0.7034624,
                            -0.62251157,
                            -0.7332216,
                            -0.96757305,
                            -0.8374378,
                            -0.6949874,
                            -0.48020548,
                            -0.4736312,
                            -0.65128595,
                            -0.81104064,
                            -0.37147376,
                            -0.86392206,
                            -0.3482467,
                            -0.8784855,
                            -0.592757,
                            -1.018985,
                            -0.6236789,
                            -0.0,
                            -0.969522,
                            -0.0,
                            -1.0717801,
                            -0.94509447,
                            -1.0363975,
                            -0.6790124,
                            -0.057982903,
                            -0.5816022,
                            -0.62164116,
                            -0.29554936,
                            -0.82961816,
                            -0.6955085,
                            -0.0,
                            -0.0,
                            -1.2063586,
                            -0.7205471,
                            -0.57468516,
                            -1.0191678,
                            -0.2947823,
                            -0.4520784,
                            -1.0827588,
                            -0.39037156,
                            -0.4888632,
                            -0.64989704,
                            -0.11298097,
                            -1.0403594,
                            -0.6276957,
                            -0.37522936,
                            -0.21123037,
                            -0.0,
                            -0.4320136,
                            -0.33121553,
                            -0.0,
                            -0.48251545,
                            -1.0228657,
                            -0.6774192,
                            -0.0,
                            -0.4855994,
                            -0.45336163,
                            -0.86937433,
                            -0.712049,
                            -0.0,
                            -0.9420002,
                            -0.8757234,
                            -0.80850726,
                            -0.6675238,
                            -0.6646069,
                            -0.8894979,
                            -0.86806434,
                            -0.9175748,
                            -0.93498826,
                            -0.88607836,
                            -0.32369193,
                            -0.40452302,
                            -0.7782058,
                            -0.993029,
                            -1.1399412,
                            -0.89593667,
                            -0.45816883,
                            -0.076819584,
                            -0.0,
                            -0.8516722,
                            -0.97815603,
                            -1.040136,
                            -1.141802,
                            -0.0,
                            -0.8291221,
                            -1.0338483,
                            -1.2078195,
                            -0.29127282,
                            -0.96892273,
                            -1.01758,
                            -0.35201856,
                            -0.0020170955,
                            -0.83929825,
                            -0.82986355,
                            -0.8679893,
                            -1.0564326,
                            -0.85363805,
                            -0.047348477,
                            -0.8354315,
                            -0.8662319,
                            -0.0,
                            -0.8626393,
                            -0.9053452,
                            -0.39439002,
                            -0.9113546,
                            -0.53074926,
                            -0.8910846,
                            -0.93353075,
                            -0.5611963,
                            -0.1599701,
                            -0.12531635,
                            -0.44789857,
                            -0.6692446,
                            -0.44591275,
                            -0.08210331,
                            -0.7828867,
                            0.4374564,
                            0.4370808,
                            0.4375457,
                            0.41884494,
                            0.43795854,
                            0.43721303,
                            0.43796924,
                            0.43769097,
                            0.43842638,
                            0.43758044,
                            0.4383826,
                            0.4378762,
                            0.43785334,
                            0.43317097,
                            0.43550405,
                            0.43790513,
                            0.437717,
                            0.43775007,
                            0.4377625,
                            0.43650088,
                            0.4379226,
                            0.43797246,
                            0.27552485,
                            0.4375793,
                            0.43824822,
                            0.43828794,
                            0.43762428,
                            0.43831387,
                            0.43786559,
                            0.4377823,
                            0.4379454,
                            0.4379814,
                            0.43653086,
                            0.43669653,
                            0.4361112,
                            0.4383602,
                            0.4339738,
                            0.4349903,
                            0.43792367,
                            0.43712425,
                            0.4375311,
                            0.27397045,
                            0.43704358,
                            0.4379613,
                            0.43825346,
                            0.43748122,
                            0.43831038,
                            0.43753707,
                            0.43710774,
                            0.43763113,
                            0.4377216,
                            0.4375183,
                            0.32425034,
                            0.43873975,
                            1.6005657,
                            0.43804353,
                            0.43738517,
                            0.43779197,
                            0.43759152,
                            0.4376364,
                            0.4377197,
                            0.4377446,
                            0.43710747,
                            0.41729566,
                            0.43712488,
                            0.43779227,
                            0.43676674,
                            0.4360652,
                            0.4386202,
                            0.432002,
                            0.43772802,
                            0.43816757,
                            0.4383507,
                            0.4375419,
                            0.43550223,
                            0.43744215,
                            0.43696555,
                            0.43791232,
                            0.43786556,
                            0.4385662,
                            0.41557276,
                            0.43998298,
                            0.43743214,
                            0.43846434,
                            0.4375868,
                            0.3928781,
                            0.43787596,
                            0.43763548,
                            0.43768907,
                            0.4373759,
                            0.42292348,
                            0.39180198,
                            0.43714494,
                            0.4376464,
                            0.43747175,
                            0.32171515,
                            0.4384147,
                            0.4374401,
                            0.4375827,
                            0.67579144,
                            0.43795675,
                            0.437384,
                            0.43777347,
                            0.27448818,
                            0.43769276,
                            0.3926684,
                            0.43758965,
                            0.4335084,
                            0.43748978,
                            0.43800777,
                            0.43733892,
                            0.43688,
                            0.4378503,
                            0.40793255,
                            0.43846145,
                            0.43763888,
                            0.43790862,
                            0.43748125,
                            0.43781266,
                            0.4367546,
                            0.43775117,
                            0.43781745,
                            0.43763724,
                            0.43741786,
                            0.43647894,
                            0.43728888,
                            0.4374946,
                            0.43733928,
                            0.43770203,
                            0.43686956,
                            0.44211015,
                            0.4379646,
                            0.4378139,
                            0.43791112,
                            0.4383592,
                            0.43600574,
                            0.4377608,
                            0.43766642,
                            0.43730158,
                            0.43659338,
                            0.4238772,
                            0.43254906,
                            0.43772408,
                            0.43844748,
                            0.43815863,
                            0.43753868,
                            0.4377495,
                            0.43806437,
                            0.43748438,
                            0.4377735,
                            0.43723324,
                            0.42563635,
                            0.31567946,
                            0.4376403,
                            0.43753514,
                            0.4378027,
                            0.43697676,
                            0.43786716,
                            0.4379943,
                            0.38637015,
                            0.43759453,
                            0.43735766,
                            0.43794665,
                            0.4384582,
                            0.43758816,
                            0.43720278,
                            0.43749043,
                            0.4178962,
                            0.43822587,
                            0.40791947,
                            0.43796262,
                            0.43761915,
                            0.448573,
                            0.43797296,
                            0.7458732,
                            0.43792436,
                            0.4381064,
                            0.41577187,
                            0.4373096,
                            0.4375156,
                            0.43802902,
                            0.43775088,
                            0.43771368,
                            0.43745926,
                            0.43742624,
                            0.43651542,
                            0.4379528,
                            0.4043109,
                            0.43780538,
                            0.43915808,
                            0.43760994,
                            0.43759197,
                            0.46756473,
                            0.43768615,
                            0.43746525,
                            0.43834576,
                            0.43783405,
                            0.4374029,
                            0.438136,
                            0.43795344,
                            0.4379876,
                            0.437867,
                            0.43719232,
                            0.43833286,
                            0.4208622,
                            0.36252844,
                            0.43795344,
                            0.43874484,
                            9.563059,
                            2.6633039,
                            1.7297846,
                            6.361981,
                            3.2719905,
                            7.734523,
                            1.0154438,
                            3.8387887,
                            0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5714507,
                            -0.0,
                            -1.2304887,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.9714855,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.39205036,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.9181591,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.8969918,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -6.3239226,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -14.924498,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.5495572,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.33562317,
                            -0.0,
                            -4.064647,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.02750492,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7036502,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.55376536,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.061666146,
                            -0.19446057,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.2238191,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.17003483,
                            -0.0,
                            -0.040337212,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.015727628,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0010896395,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.04060688,
                            -0.0,
                            -0.0,
                            -0.24848014,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.05595577,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.053995203,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.10314718,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.43244448,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.1793159,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7703675,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5762424,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.4464729,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.38887545,
                            -0.5564316,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
