{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.8.0",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "probabilities"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            11.354831,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            3.3139257,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            2.880955,
                            7.424088,
                            5.31768,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.5461497,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.790638,
                            -0.0,
                            -0.32366675,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.55574095,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0417143,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2540525,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.7957821,
                            -0.0,
                            -0.0,
                            -2.4545412,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.19798647,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.3545347,
                            -0.0,
                            -8.497551,
                            -6.285498,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7172561,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.43618712,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0401798,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.015812,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.5721369,
                            -0.0,
                            -0.0,
                            -0.88660073,
                            -2.5985541,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.56382704,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.575498,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.6782275,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.6303236,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.027152143,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -40.970127,
                            -100.0,
                            -98.10603,
                            -0.0,
                            -67.70533,
                            -100.0,
                            -0.0,
                            -84.706024,
                            -0.0,
                            -6.3512363,
                            -100.0,
                            -0.0,
                            -0.0,
                            -84.67869,
                            -0.0,
                            -0.0,
                            -23.440956,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -51.338478,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -47.40352,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -36.544064,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -100.0,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -5.751498,
                            -0.0,
                            -0.0,
                            -0.43468902,
                            -0.0,
                            -31.375828,
                            -100.0,
                            -56.23589,
                            -100.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -74.69727,
                            -47.285793,
                            -100.0,
                            -0.0,
                            -70.87247,
                            -0.0,
                            -100.0,
                            -0.0,
                            -0.0,
                            -100.0,
                            -15.685846,
                            -52.987213,
                            -76.99635,
                            -0.0,
                            -0.0,
                            -46.543552,
                            -100.0,
                            -100.0,
                            -100.0,
                            -43.514164,
                            -100.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -15.666319,
                            -8.504032,
                            -100.0,
                            -0.0,
                            -100.0,
                            -55.62682,
                            -100.0,
                            -2.2248962,
                            -0.0,
                            -52.608356,
                            -16.035265,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.8644034,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.718399,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            5.177651,
                            7.1797495,
                            1.6079293,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            1.5388787,
                            0.86059403,
                            1.4537287,
                            1.3939838,
                            0.91231924,
                            0.26950064,
                            1.4743711,
                            1.6135808,
                            0.5711685,
                            2.1098697,
                            0.7311219,
                            1.2853947,
                            2.415308,
                            0.6727941,
                            1.6574817,
                            0.0,
                            1.5353818,
                            1.6413212,
                            0.09401173,
                            2.052267,
                            1.6582313,
                            3.8353362,
                            1.4917223,
                            0.80717623,
                            0.0,
                            0.6683849,
                            0.13454092,
                            11.830002,
                            1.1091669,
                            0.0,
                            0.12404754,
                            1.3095188,
                            1.5130172,
                            1.9123449,
                            1.0983728,
                            0.43611708,
                            2.6607857,
                            0.6199151,
                            0.92909175,
                            0.0,
                            0.8469751,
                            0.9651756,
                            0.9291282,
                            0.44142732,
                            0.6812476,
                            1.4566834,
                            0.0,
                            0.9628834,
                            1.2730778,
                            2.150626,
                            0.0,
                            1.0928651,
                            6.4504285,
                            0.6906049,
                            1.0226532,
                            1.103112,
                            1.2720077,
                            5.246514,
                            0.0,
                            1.1290579,
                            1.4864941,
                            0.5687447,
                            0.8346376,
                            0.3087785,
                            0.5604482,
                            1.0501332,
                            1.0337903,
                            0.0,
                            1.3388498,
                            1.0902196,
                            1.6691359,
                            1.278419,
                            0.8954072,
                            2.3675478,
                            0.16390872,
                            2.2336001,
                            0.4122211,
                            0.0,
                            5.992943,
                            2.1804793,
                            0.0,
                            1.1194355,
                            0.37000012,
                            0.0,
                            1.4603657,
                            1.3127288,
                            0.43302494,
                            1.3512121,
                            2.3921974,
                            0.4221092,
                            0.67891514,
                            1.1046703,
                            1.7497033,
                            1.0427443,
                            3.305903,
                            3.6526506,
                            1.3071655,
                            1.4005452,
                            1.3348638,
                            6.979322,
                            0.0,
                            0.042055346,
                            1.4555044,
                            0.9229377,
                            2.365284,
                            3.4320765,
                            0.14345916,
                            1.2091132,
                            1.5733526,
                            1.5198683,
                            1.6044027,
                            0.0,
                            0.0,
                            0.7942898,
                            1.0577052,
                            0.88835776,
                            0.31205758,
                            0.46251246,
                            0.0,
                            0.92129487,
                            0.9257513,
                            1.4185283,
                            0.23537396,
                            0.26783714,
                            2.2378523,
                            1.4218978,
                            0.14024104,
                            0.9158704,
                            1.0055327,
                            1.2694678,
                            2.652288,
                            1.0447594,
                            0.77345526,
                            4.1891513,
                            1.0432434,
                            1.4660174,
                            1.0229336,
                            1.265399,
                            0.0,
                            2.3439052,
                            3.260198,
                            0.5951588,
                            3.6462026,
                            1.8003042,
                            0.4824694,
                            1.1573651,
                            0.0,
                            0.8149382,
                            3.177258,
                            3.8721342,
                            2.060113,
                            1.5981944,
                            0.82793844,
                            6.6015835,
                            1.4393736,
                            5.8081346,
                            0.3296562,
                            0.7100722,
                            2.7077396,
                            0.21996436,
                            1.191269,
                            0.91697496,
                            0.0,
                            1.472372,
                            0.04742775,
                            0.11036974,
                            0.08499446,
                            1.221246,
                            1.479652,
                            1.3372163,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            2.3591423,
                            1.7419131,
                            1.0664244,
                            1.4135531,
                            1.1470419,
                            1.2105108,
                            -0.42152345,
                            -0.40882197,
                            -0.41493845,
                            -0.42143154,
                            -0.42146754,
                            -0.42124534,
                            -0.42143133,
                            -0.421053,
                            -3.1661167,
                            -0.42124274,
                            -1.9161226,
                            -0.42144647,
                            -0.42059898,
                            -1.0733906,
                            -0.4199174,
                            -0.42125788,
                            -0.42107084,
                            -0.42167002,
                            -0.42096868,
                            -0.36778194,
                            -0.41981232,
                            -0.41826123,
                            -0.42116737,
                            -0.42142546,
                            -0.42128196,
                            -0.40846667,
                            -0.3941786,
                            -0.4193478,
                            -0.30287477,
                            -0.42902264,
                            -0.34249192,
                            -0.4212896,
                            -1.0271809,
                            -0.4213141,
                            -16.45683,
                            -0.29402018,
                            -0.4212411,
                            -0.4212084,
                            -0.41579145,
                            -0.421393,
                            -0.41860515,
                            -0.42129698,
                            -0.98342335,
                            -0.9934873,
                            -0.42130497,
                            -0.4061487,
                            -0.41273788,
                            -0.40914115,
                            -0.42190978,
                            -1.6685381,
                            -4.971242,
                            -6.5349026,
                            -0.42147952,
                            -9.6543,
                            -8.6894245,
                            -0.23807271,
                            -0.2836136,
                            -2.4811447,
                            -0.42133272,
                            -0.3750308,
                            -0.41920584,
                            -1.5070895,
                            -0.42113835,
                            -0.29361728,
                            -0.42125046,
                            -0.42190486,
                            -0.4212969,
                            -1.4258024,
                            -0.42117912,
                            -0.5448125,
                            -0.27482864,
                            -0.42106813,
                            -0.42109624,
                            -18.79562,
                            -0.42137593,
                            -0.4211353,
                            -0.42130652,
                            -0.22529803,
                            -0.39989156,
                            -0.41750506,
                            -2.7000623,
                            -0.42117152,
                            -1.0337126,
                            -0.42120904,
                            -0.40183833,
                            -0.42134044,
                            -1.1647218,
                            -0.40286806,
                            -0.4212794,
                            -0.42115262,
                            -0.4210355,
                            -0.39051655,
                            -0.23935734,
                            -0.3929484,
                            -0.42124665,
                            -0.25282484,
                            -0.22298366,
                            -0.3435599,
                            -0.41557437,
                            -0.4212704,
                            -0.41787395,
                            -0.4183034,
                            -0.43295693,
                            -0.40205294,
                            -0.4070203,
                            -0.4212434,
                            -0.4213234,
                            -5.1884117,
                            -0.25291967,
                            -0.4214037,
                            -0.41071495,
                            -0.4213101,
                            -0.26636794,
                            -0.42110863,
                            -0.40305722,
                            -0.41602138,
                            -0.4199383,
                            -0.4206395,
                            -0.42108956,
                            -1.0258467,
                            -0.41576713,
                            -2.035971,
                            -0.42047864,
                            -0.41894114,
                            -0.42142138,
                            -0.42139226,
                            -20.767334,
                            -0.39572856,
                            -0.39193386,
                            -0.4212723,
                            -0.4213654,
                            -0.41656846,
                            -1.6098703,
                            -0.41704604,
                            -0.41370717,
                            -0.4201556,
                            -0.42132702,
                            -0.38602424,
                            -0.29351684,
                            -0.421286,
                            -0.4163502,
                            -0.7155968,
                            -0.42123348,
                            -0.40899515,
                            -0.39328608,
                            -0.41949758,
                            -0.41990116,
                            -0.3870098,
                            -0.3918385,
                            -0.4211381,
                            -0.41748685,
                            -0.42136794,
                            -0.4214297,
                            -2.3423393,
                            -0.4180322,
                            -0.42126456,
                            -0.42088348,
                            -0.8278672,
                            -0.2870585,
                            -1.1952856,
                            -0.37215844,
                            -0.42123488,
                            -1.7892492,
                            -0.34703168,
                            -0.42108727,
                            -1.5441399,
                            -0.420304,
                            -0.42143664,
                            -0.41820318,
                            -0.43611303,
                            -0.42123824,
                            -0.42118263,
                            -0.42128336,
                            -0.40512785,
                            -1.0308734,
                            -0.4209855,
                            -0.419338,
                            -0.26758477,
                            -0.4208979,
                            -0.4214679,
                            -0.42112777,
                            -16.418877,
                            -0.41295558,
                            -0.42074397,
                            -0.42116457,
                            -0.34689456,
                            -0.0,
                            -0.41849613,
                            -0.41657934,
                            -0.42129734,
                            -0.606508,
                            -1.6525007,
                            -0.40203333,
                            -0.4214212,
                            -0.41287383,
                            -0.42167515,
                            -0.4211322,
                            -0.41105363,
                            -1.6994317,
                            -0.42180818,
                            -0.42128378,
                            -0.42063192,
                            -0.39768398,
                            -0.42129532,
                            -0.42102778,
                            -0.42129102,
                            -0.42140448,
                            -0.27690607,
                            -0.42175627,
                            -0.4214067,
                            -0.25619027,
                            -0.4212579,
                            -0.3207919,
                            -0.4209924,
                            -0.736265,
                            -0.39660412,
                            -0.40707886,
                            -0.23797944,
                            -0.4210878,
                            -0.38402086,
                            -0.41942012,
                            -0.37401226,
                            -0.25816116,
                            -13.164765,
                            -0.32967532,
                            -0.42165637,
                            -0.4210307,
                            -0.42129958,
                            -0.39733982,
                            -0.42122567,
                            -0.42126417,
                            -0.2571306,
                            -0.41524285,
                            -0.3887069,
                            -0.42143664,
                            -0.4211471,
                            -0.42139098,
                            -0.37858832,
                            -0.4013845,
                            -0.41700125,
                            -0.8970485,
                            -0.4213911,
                            -0.7996251,
                            -0.0,
                            -0.44716156,
                            -1.7755456,
                            -0.0,
                            -2.2810931,
                            -3.536233,
                            -0.47962812,
                            -5.434928,
                            -1.7263271,
                            -1.6547203,
                            -8.510284,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.2077658,
                            -0.0,
                            -0.0,
                            -2.0062938,
                            -0.0,
                            -0.4605242,
                            -0.0,
                            -0.0,
                            -1.0552891,
                            -7.8357253,
                            -0.0,
                            -1.2979844,
                            -4.3920755,
                            -0.0,
                            -2.1636524,
                            -0.0,
                            -1.761425,
                            -0.0,
                            -0.009716943,
                            -0.0,
                            -2.5180557,
                            -9.193055,
                            -0.0,
                            -3.9089544,
                            -2.180304,
                            -1.4503094,
                            -3.751007,
                            -7.9786577,
                            -0.24479994,
                            -0.0,
                            -0.0,
                            -0.7900908,
                            -1.8462306,
                            -0.4154007,
                            -0.022480568,
                            -2.9283364,
                            -3.7654316,
                            -0.0,
                            -0.0,
                            -2.1025763,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.14947143,
                            -4.0958676,
                            -0.0,
                            -0.0,
                            -2.1526845,
                            -0.016897112,
                            -0.0,
                            -1.4013323,
                            -0.0,
                            -0.0,
                            -0.037259012,
                            -3.1087415,
                            -3.0938618,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -3.026248,
                            -0.99589694,
                            -6.0354104,
                            -3.2741532,
                            -0.0,
                            -0.0,
                            -1.8041147,
                            -5.00316,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.8127484,
                            -10.762593,
                            -0.0,
                            -0.0,
                            -1.5429375,
                            -4.1649923,
                            -0.0,
                            -4.239606,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.0115862,
                            -0.13857965,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.7752836,
                            -0.0,
                            -5.02983,
                            -0.0,
                            -0.8229558,
                            -1.0163368,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.4473648,
                            -1.141664,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -2.3884315,
                            -0.13619527,
                            -1.6080657,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.23391032,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -4.506193,
                            -0.0,
                            -0.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            89.721115,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            16.347935,
                            100.0,
                            1.8157315,
                            48.07084,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            48.465977,
                            100.0,
                            100.0,
                            100.0,
                            55.109013,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            54.760105,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            100.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.012210381,
                            0.0,
                            0.0,
                            0.3463005,
                            0.0,
                            0.77812,
                            0.0,
                            0.0,
                            0.0046738167,
                            6.2398067,
                            0.85994524,
                            0.07243249,
                            0.0,
                            0.3481098,
                            0.0,
                            0.10836979,
                            0.08761422,
                            0.0,
                            2.3946664,
                            1.0686725,
                            0.0,
                            1.4052048,
                            0.0041444483,
                            0.9106878,
                            0.13941088,
                            0.055664312,
                            0.0,
                            2.5485277,
                            0.0,
                            0.0,
                            1.6815954,
                            0.21255341,
                            0.75099385,
                            0.5542963,
                            0.0,
                            0.6903493,
                            0.0,
                            0.0,
                            0.0,
                            0.09927605,
                            0.23972622,
                            0.11817295,
                            0.021578226,
                            0.071346514,
                            4.3522105,
                            0.11903441,
                            5.7107224,
                            0.0,
                            6.4479775,
                            0.27191088,
                            1.7317222,
                            0.19456482,
                            1.0200447,
                            0.0,
                            0.0,
                            0.0,
                            1.6045754,
                            0.13544469,
                            0.0,
                            0.0,
                            0.0,
                            1.893099,
                            0.0,
                            0.0,
