{
    "irVersion": "7",
    "producerName": "skl2onnx",
    "producerVersion": "1.13",
    "domain": "ai.onnx",
    "modelVersion": "0",
    "docString": "",
    "graph": {
        "node": [
            {
                "input": [
                    "X",
                    "transform_matrix"
                ],
                "output": [
                    "variable"
                ],
                "name": "SklearnTruncatedSVD",
                "opType": "MatMul",
                "domain": ""
            },
            {
                "input": [
                    "variable"
                ],
                "output": [
                    "label",
                    "SVM02"
                ],
                "name": "SVMc",
                "opType": "SVMClassifier",
                "attribute": [
                    {
                        "name": "classlabels_ints",
                        "ints": [
                            "0",
                            "1",
                            "2",
                            "3"
                        ],
                        "type": "INTS"
                    },
                    {
                        "name": "coefficients",
                        "floats": [
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.023357635,
                            0.0,
                            0.0,
                            0.0,
                            0.016899498,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.017738663,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.09343609,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.26958323,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.04216681,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.052541915,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.08229203,
                            0.0,
                            0.004313542,
                            0.0,
                            0.0,
                            0.040636044,
                            0.39101136,
                            0.07450236,
                            0.0,
                            0.66018987,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.73226756,
                            0.0,
                            0.0,
                            0.026803868,
                            0.01192697,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.20134704,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.02308543,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.080945864,
                            0.45254633,
                            0.0,
                            0.023577077,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.032393575,
                            0.0,
                            0.0,
                            0.12548564,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.062574595,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.7268789,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.30016297,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.2405267,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.26519024,
                            0.0,
                            0.3152812,
                            0.0,
                            0.0,
                            0.08048065,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.09150642,
                            0.0,
                            0.039407156,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.11158706,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.34025434,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.14724937,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.053526785,
                            0.0,
                            0.031622045,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.0,
                            0.3522173,
                            0.0,
                            1.0199919,
                            0.0,
                            0.0,
                            -0.20619583,
                            -0.0,
                            -1.7878006,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5945946,
                            -1.5952727,
                            -1.2541685,
                            -0.0,
                            -1.219474,
                            -0.0,
                            -0.0,
                            -0.5947798,
                            -0.1600123,
                            -0.0,
                            -0.0,
                            -0.5297747,
                            -0.0,
                            -0.7807669,
                            -0.15853795,
                            -0.0,
                            -0.4669976,
                            -1.1481469,
                            -0.10188884,
                            -0.5703078,
                            -0.21808593,
                            -0.94722617,
                            -0.8233498,
                            -0.0737929,
                            -0.0,
                            -0.80118054,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5669453,
                            -1.1580924,
                            -1.2954739,
                            -0.0,
                            -0.0,
                            -1.7324495,
                            -1.7272167,
                            -1.2986269,
                            -0.0,
                            -0.0,
                            -0.68679553,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0009059818,
                            -0.0,
                            -1.6899753,
                            -1.3082863,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.6993186,
                            -0.0,
                            -0.28891328,
                            -1.1319503,
                            -0.0,
                            -0.4544852,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.31108254,
                            -0.0,
                            -0.1518201,
                            -0.0,
                            -0.0,
                            -1.3020028,
                            -0.39186808,
                            -0.7701463,
                            -0.2219897,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5683773,
                            -0.32084328,
                            -1.708478,
                            -0.0,
                            -0.0,
                            -0.68971217,
                            -0.0,
                            -1.0864098,
                            -0.0,
                            -0.0,
                            -0.3443644,
                            -0.0,
                            -0.28723606,
                            -0.0,
                            -0.0,
                            -0.6299131,
                            -0.5621489,
                            -1.5467705,
                            -0.0,
                            -1.409779,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.019580862,
                            -0.0,
                            -1.3145701,
                            -0.0,
                            -0.57655126,
                            -0.6321143,
                            -0.0,
                            -0.34765735,
                            -0.89673764,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.4877448,
                            -0.0,
                            -0.7800146,
                            -0.0,
                            -1.1089127,
                            -1.4842653,
                            -1.2727575,
                            -0.0,
                            -0.89612645,
                            -0.1329178,
                            -0.8246129,
                            -0.0,
                            -0.43069425,
                            -0.0,
                            -1.973007,
                            -0.0,
                            -0.0,
                            -1.4015138,
                            -0.0,
                            -1.4184452,
                            -0.8130028,
                            -0.0,
                            -0.0,
                            -1.4455427,
                            -0.0031645542,
                            -0.0,
                            -2.7177937,
                            -0.0,
                            -1.4830997,
                            -0.0,
                            -0.0,
                            -0.6557468,
                            -0.0,
                            -0.024616873,
                            -0.0,
                            -0.36538583,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0707692,
                            -0.0,
                            -0.1293006,
                            -0.0,
                            -0.0,
                            -1.2454107,
                            -1.0341821,
                            -0.0,
                            -1.0770545,
                            -0.0,
                            -0.0,
                            -0.035308883,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9394571,
                            -1.6649086,
                            -0.0,
                            -0.6419872,
                            -0.0,
                            -0.0,
                            -0.3630707,
                            -1.9117886,
                            -0.0,
                            -0.22549646,
                            -0.0,
                            -0.501102,
                            -0.0,
                            -1.5116385,
                            -1.8157881,
                            -0.0,
                            -0.09653714,
                            -1.1891991,
                            -0.6238258,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9652392,
                            -0.0,
                            -0.15382549,
                            -0.12310375,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.7014448,
                            -0.74180806,
                            -0.6514879,
                            -1.2295033,
                            -0.19141275,
                            -0.0,
                            -0.9947943,
                            -0.0,
                            -0.017590212,
                            -3.4575055,
                            -0.8576699,
                            -0.7103656,
                            -0.52330047,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.1001475,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.1775689,
                            -0.0,
                            -0.65010124,
                            -0.0,
                            -0.0,
                            -0.38606513,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.0787816,
                            -0.0,
                            -0.0,
                            -1.1674083,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.406268,
                            -1.0653977,
                            -0.0,
                            -0.808683,
                            -0.40275764,
                            -0.0,
                            -0.5000828,
                            -12.890025,
                            -0.22974108,
                            -0.07485401,
                            -1.8226016,
                            -0.0,
                            -0.0,
                            -0.9083226,
                            -0.0,
                            -0.21951339,
                            -0.0,
                            -0.30244866,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.940961,
                            -1.4764103,
                            -0.0,
                            -0.0,
                            -0.95460707,
                            -0.63586056,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.4776151,
                            -1.3079929,
                            -0.19221614,
                            -0.29051882,
                            -1.0165673,
                            -0.0,
                            -0.14700079,
                            -0.17717405,
                            -0.0,
                            -0.78655976,
                            -1.6361024,
                            -0.59920657,
                            -0.0,
                            -2.5775244,
                            -0.19047672,
                            -0.0,
                            -1.1102779,
                            -0.16731614,
                            -0.0,
                            -1.0919806,
                            -0.27218786,
                            -0.0,
                            -0.0,
                            -1.01434,
                            -0.33649662,
                            -0.0,
                            -0.35790914,
                            -0.14729206,
                            -0.0,
                            -1.0813099,
                            -0.2891774,
                            -0.011755648,
                            -0.0,
                            -0.8048516,
                            -0.0,
                            -0.0,
                            -0.77797526,
                            -0.354287,
                            -0.1774956,
                            -0.33858055,
                            -0.23713876,
                            -0.3094145,
                            -0.3622584,
                            -0.0,
                            -0.77302533,
                            -0.8385425,
                            -0.0,
                            -0.04963545,
                            -0.88774174,
                            -0.5059394,
                            -0.0,
                            -0.3240298,
                            -0.0,
                            -0.0,
                            -2.4144578,
                            -0.43809155,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5907162,
                            -0.4866447,
                            -1.0573856,
                            -0.0,
                            -0.0,
                            -0.62707525,
                            -0.0,
                            -0.6870122,
                            -0.84908825,
                            -0.0,
                            -0.0,
                            -0.22800413,
                            -0.0,
                            -0.0067820223,
                            -0.0,
                            -0.0,
                            -1.1527432,
                            -0.0,
                            -0.7224617,
                            -0.21939215,
                            -0.3561121,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.53642493,
                            -0.0,
                            -1.3238187,
                            -0.5782214,
                            -0.0,
                            -0.7606756,
                            -0.03815104,
                            -0.3001291,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.63791364,
                            -0.0,
                            -0.15703909,
                            -1.1137542,
                            -1.5138674,
                            -0.20482904,
                            -1.2880089,
                            -0.82415235,
                            -0.0,
                            -0.54608893,
                            -0.0,
                            -0.402115,
                            -0.0,
                            -0.0,
                            -0.40962887,
                            -0.24422435,
                            -0.0,
                            -0.72011864,
                            -0.6593828,
                            -0.43409336,
                            -0.21487689,
                            -0.48904312,
                            -0.22188413,
                            -0.7678539,
                            -0.49012774,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.01207879,
                            -0.0,
                            -0.7437314,
                            -0.95272154,
                            -1.3502854,
                            -0.115553774,
                            -0.109845564,
                            -1.5837137,
                            -0.0,
                            -0.3320654,
                            -0.7678246,
                            -0.0,
                            -1.5948647,
                            -1.1268448,
                            -0.0,
                            -0.41943946,
                            -0.0,
                            -1.3433508,
                            -0.0,
                            -0.19160408,
                            -1.2591044,
                            -0.0,
                            -0.8831761,
                            -0.0,
                            -0.0,
                            -0.97160655,
                            -0.0,
                            -0.59520984,
                            -0.0,
                            -0.83833617,
                            -0.0,
                            -0.67181486,
                            -0.39225975,
                            -0.0,
                            -0.0,
                            -0.3783925,
                            -0.0,
                            -0.10162196,
                            -0.0,
                            -0.88107073,
                            -0.5473256,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.51131374,
                            -0.3857852,
                            -1.0708424,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.9285892,
                            -0.0,
                            -0.092301756,
                            -1.3313183,
                            -0.21143782,
                            -0.34620646,
                            -0.9789154,
                            -0.5097589,
                            -0.6290511,
                            -0.0,
                            -0.0,
                            -0.25048295,
                            -0.17688702,
                            -1.7875898,
                            -1.5785532,
                            -0.27935258,
                            -0.84837556,
                            -0.72331524,
                            -0.0,
                            -0.7312687,
                            -0.0,
                            -0.0,
                            -0.2062121,
                            -0.6545616,
                            -0.9874816,
                            -0.81838083,
                            -0.58238125,
                            -0.0,
                            -7.7431197,
                            -0.59436977,
                            -0.0,
                            -0.49411297,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.2225747,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -1.5748563,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.5148348,
                            -1.1202062,
                            -0.67071056,
                            -0.0,
                            -0.12599175,
                            -0.0,
                            -0.6360713,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.12007892,
                            -0.0,
                            -0.82530063,
                            -0.73072004,
                            -0.3280973,
                            -0.06971946,
                            -0.0,
                            -0.0,
                            -0.7224607,
                            -0.0,
                            -0.5717519,
                            -0.0,
                            -0.0,
                            -0.19311824,
                            -0.0,
                            -0.12412868,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.24180603,
                            -0.4809106,
                            -0.27279678,
                            -0.8867144,
                            -2.4709766,
                            -0.0,
                            -1.0315157,
                            -0.39930558,
                            -0.023845075,
                            -0.4688727,
                            -0.0,
                            -0.6594503,
                            -0.025756188,
                            -0.7679268,
                            -0.6172464,
                            -0.0,
                            -1.0606257,
                            -0.18813889,
                            -0.0,
                            -0.0,
                            -0.7565821,
                            -0.2196134,
                            -0.38854718,
                            -0.09867964,
                            -0.6068342,
                            -1.1015109,
                            -0.0,
                            -0.9050368,
                            -0.0,
                            -0.43546006,
                            -0.14384022,
                            -1.569731,
                            -1.0544485,
                            -0.88635266,
                            -0.0,
                            -0.0,
                            -1.5918679,
                            -0.0,
                            -0.65082926,
                            -0.43053648,
                            -0.0,
                            -0.0,
                            -0.0,
                            -0.45508024,
                            -0.0,
                            -0.0,
                            -1.0850706,
                            -0.49724978,
                            -0.0,
                            -0.5607812,
                            -0.18243873,
                            -1.0806892,
                            -0.0,
                            -0.0,
                            -0.6638243,
                            -0.0046719825,
                            -0.0,
                            0.27665475,
                            0.080630794,
                            0.072700985,
                            0.14288609,
                            0.11616153,
                            0.37160233,
                            0.1481865,
                            0.1119253,
                            0.21842563,
                            0.48883668,
                            0.09039083,
                            0.11442755,
                            0.24271218,
                            0.1483914,
                            0.2066632,
                            0.063622914,
                            0.33583593,
                            0.25725788,
                            0.105648324,
                            0.13948627,
                            0.14157291,
                            0.18838114,
                            0.14936334,
                            0.14931548,
                            0.14147066,
                            1.27842,
                            0.16634083,
                            0.12363479,
                            0.12906075,
                            0.14142531,
                            0.1308746,
                            0.120666854,
                            0.106396645,
                            0.11696342,
                            0.12449903,
                            0.09605636,
                            0.14607942,
                            0.28272894,
                            0.13014331,
                            0.17441082,
                            0.07844746,
                            0.13504374,
                            0.14630306,
                            0.13697895,
                            0.0,
                            0.16741036,
                            0.13726518,
                            0.12858194,
                            0.12788224,
                            0.3514234,
                            0.10545466,
                            0.14708404,
                            0.03602673,
                            0.14943376,
                            0.14785887,
                            0.5003309,
                            0.13790832,
                            0.1470987,
                            0.13914306,
                            0.0,
                            0.15070784,
                            0.20922978,
                            0.35787848,
                            0.14964315,
                            0.102513194,
                            0.1403257,
                            0.1669435,
                            0.21547368,
                            0.09747123,
                            0.1895928,
                            0.12347443,
                            0.12350255,
                            0.16464786,
                            0.14113188,
                            0.20356512,
                            0.08397713,
                            0.06989233,
                            0.08797615,
                            0.10456507,
                            0.091028884,
                            0.18238975,
                            0.33308917,
                            0.09780262,
                            0.13508826,
                            0.17167927,
                            0.5910938,
                            0.18001632,
                            0.14672711,
                            0.021368498,
                            0.12675683,
                            0.11299685,
                            1.5116906,
                            0.11254171,
                            0.047987744,
                            0.10376029,
                            0.16797201,
                            0.14666665,
                            0.11261025,
                            0.0938743,
                            1.0050956,
                            0.1222274,
                            0.141775,
                            0.12781358,
                            0.39915928,
                            0.46604896,
                            0.15260616,
                            0.16422205,
                            0.08515097,
                            0.5591175,
                            0.08421777,
                            0.11118103,
                            0.0,
                            0.10414687,
                            0.06718459,
                            0.045189876,
                            0.1557472,
                            0.13998614,
                            0.10575524,
                            0.0897904,
                            0.1600201,
                            0.105711006,
                            0.14738433,
                            0.14779352,
                            0.047725726,
                            0.130255,
                            0.43866274,
                            0.07140063,
                            0.19097452,
                            0.2851904,
                            0.077912614,
                            0.14036676,
                            0.16858737,
                            0.08876905,
                            0.09781419,
                            0.1356843,
                            0.12461549,
                            0.15011263,
                            0.21231557,
                            0.13071513,
                            0.0,
                            0.3903809,
                            0.48230347,
                            0.12508634,
                            0.14740764,
                            0.08936122,
                            0.09110827,
                            0.087085575,
                            0.14885499,
                            0.15285313,
                            0.13275573,
                            0.07500905,
                            0.083296366,
                            0.16899128,
                            0.48506603,
                            0.16388276,
                            0.46113113,
                            0.054321367,
                            0.23418142,
                            0.48855633,
                            2.4394128,
                            0.17657016,
                            0.14464116,
                            0.5589734,
                            0.0924303,
                            0.117128484,
                            0.14684024,
                            0.14532192,
                            0.14956884,
                            0.14332621,
                            0.14937392,
                            0.14066735,
                            0.14414209,
                            0.13359575,
                            0.12572098,
                            0.18268476,
                            0.23595065,
                            0.092991054,
                            3.112418,
                            0.092687525,
                            0.12793618,
                            0.66701084,
                            0.22382236,
                            0.11614572,
                            0.0,
                            0.14942047,
                            0.14237791,
                            0.18750195,
                            0.004771587,
                            0.12182546,
                            0.091627955,
                            0.097860195,
                            0.13260172,
                            0.16183794,
                            0.009315623,
                            0.14748135,
                            0.0,
                            0.43653813,
                            0.17432612,
                            0.18402591,
                            0.13283484,
                            0.11380881,
                            0.03127795,
                            0.16087912,
                            0.15675996,
                            0.0017492048,
                            0.13105465,
                            0.22968866,
                            0.12677798,
                            0.03779322,
                            0.47221813,
                            0.15155292,
                            0.12137276,
                            0.18009137,
                            0.14357914,
                            0.15224849,
                            0.12970603,
                            0.014486561,
                            0.07690245,
                            0.5814094,
                            2.5308943,
                            0.0,
                            0.47602293,
                            0.20424208,
                            0.095174655,
                            0.12895769,
                            0.11929028,
                            0.12809432,
                            0.22528028,
                            0.15080185,
                            0.17336413,
                            0.14463346,
                            0.24475263,
                            0.08547532,
                            0.10456163,
                            0.09593662,
                            0.1609391,
                            0.076914154,
                            0.6707919,
                            0.13519496,
                            0.14872298,
                            0.5124715,
                            0.14088388,
                            0.09251031,
                            0.11853633,
                            0.5109952,
                            0.14783306,
                            0.18058391,
                            0.68517107,
                            0.07575199,
                            0.13878421,
                            0.09104607,
                            0.8459763,
                            0.17042951,
                            0.09546557,
                            0.10902998,
                            0.13487722,
                            0.08636215,
                            0.118187405,
                            0.1460135,
                            0.07134302,
                            0.14306985,
                            0.39463097,
                            0.13610835,
                            0.12981819,
                            0.1643703,
                            0.075239204,
                            0.27157068,
                            0.116950005,
                            0.25950736,
                            0.7168555,
                            0.11943103,
                            2.461132,
                            0.16623105,
                            0.06321169,
                            0.15404843,
                            0.09215988,
                            0.17269738,
                            0.16916375,
                            0.16385764,
                            0.10633447,
                            0.43323922,
                            0.14614789,
                            0.022972262,
                            0.049191665,
                            0.019793974,
                            1.6007539,
                            0.17318167,
                            0.14641014,
                            0.09316843,
                            0.122615874,
                            0.111357,
                            0.0,
                            0.13462284,
                            0.14869669,
                            0.07731485,
                            0.060471524,
                            0.120188855,
                            0.15917778,
                            0.1342597,
                            0.25902376,
                            0.29779047,
                            0.10504247,
                            0.21924202,
                            0.3766446,
                            0.14682725,
                            0.13336992,
                            0.1621485,
